{"url": "https://isthmus.com/food-drink/beer/noble-roots-in-madison/", "title": "It’s worth looking for Green Bay’s Noble Roots in Madison", "text": "Plus more beer news for February. byRobin Shepard Beer February 14, 2026 8:00 AM Robin Shepard The lineup encompasses many styles but leans to Belgians. It’s easy to miss the beers ofNoble Roots Brewing Companyon Madison shelves. The small Green Bay brewery makes only about 750 barrels a year. That’s not a lot even to supply Green Bay, yet co-owner Alex Falish, a UW-Madison grad, calls distributing to Madison “a passion project.” Falish and his father, Marvin, started the brewery after venturing into homebrewing together nearly 20 years ago. Falish tries to make the trip to Madison to distribute every six or seven weeks toGarth’s Brew Bar, theLongtable Beer CafeandBarleyPop Tap and Shop, often with new releases. The brewery’s Strict Observance, a Belgian tripel, recently caught my eye. It has musty, fruity Belgian yeast character that’s sweet at the start, yet finishes dry and warm at 9.5% ($15/four-pack). Noble Roots takes special pride in its Belgian releases. “Our area of Wisconsin is known for Belgian settlement and people here like those styles,” says Falish. Noble Roots also makes Kermis, a Belgian dubbel originally created for the local Belgian heritage festival. Among the brewery’s core offerings is Mackinac Island Amber ($13/four-pack). That brown ale has been offered since the brewery opened in 2017 and is among its flagship brews. It’s made with orange peel, which lends a sharp tropical fruitiness to the dry-hot spicy kick of ginger. In February, Falish has three new beers headed for Madison. Alpine Folly is a cold IPA with assertive tropical flavor from Citra, Mandarina Bavaria and Sorachi Ace hops, and ends up at 6% ABV. If you like the German dunkles bock style, watch for The Goatman’s Oath. It has floral sweetness and finishes warm at 6.6% ABV. And, just in time for the height of bock season, there’s Winnie’s Honey Bock, made with additions of honey and finishing at 6.8% ABV. These latest beers are packaged in 16-ounce cans and four-packs ($13). Note: The weather does affect Falish’s ability to make it to Madison. More beer news:Delta Beer Lab and Vintage Brewing were recently paired up by random drawing in the Madison Area Craft Beverage Producers’ Blind Date program that matches local breweries, cideries and distilleries and asks them to create unique limited releases in time for Valentine’s Day. Crews from both breweries were at Delta’s brewhouse in early January for a joint brewday. “We’ve been wanting to make a Baltic porter and never have, so when Vintage offered some malts that would work well, it all came together,” says Delta's Tim Piotrowski. A Baltic porter is a robust dark beer made with a porter recipe and fermented cold with lager yeast. Watch for it on tap at both breweries beginning Feb. 14. A big beer to trywhile it’s still winter isBroken Bat Brewing Company’s762* (a.k.a. The King), an imperial stout aged in Heaven Hill bourbon barrels — perfect in front of a fireplace on a cold night. It has strong chocolate and roasted coffee flavor and finishes at a warming 10.4% ABV ($17/four-pack). Upcoming beer events February 20-23 Sloshed and Slushy Winter Beer Festat Working Draft Beer Company. Three days featuring at least 17 different beers, music and food. Look for an ice version of the brewery’s GABF gold medal winning doppelbock Klosterade. February 21 Battle of the Barrels at Lake LouieBrewing in Verona. More than a dozen local breweries and distilleries will be side-by-side in the Wisconsin Brewing Company brewhouse offering comparisons of barrel-aged beers and spirits. February 28 29th Annual Bockfest at Capital Breweryin Middleton. Features the release of the brewery’s Blonde Doppelbock. 7th Anniversary Celebration at Delta Beer Lab. Among the special beer releases will be Schrödinger’s Honey Bock, a lager made with 20 pounds of honey in every seven barrel batch. byRobin Shepard February 14, 2026 8:00 AM", "date": "2026-02-14", "author": "byRobin Shepard", "section": "food-drink", "location": "middleton", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/mariners-inn-waterfront-site-to-host-new-restaurant/", "title": "Mariner’s Inn waterfront site to host restaurant in new development", "text": "Lakestone Properties is open to a concept that fits the location byLinda Falkenstein Food & Drink January 14, 2026 1:10 PM Courtesy Lakestone Properties Outdoor seating and docks for boat-up diners are planned as part of a new development on the site of the Mariner's Inn. The Mariner’s Inn site in the town of Westport will be redeveloped with multi-unit housing including space for a first-floor, waterfront dining space. The developer is McFarland-based Lakestone Properties. The units are planned as apartments. The concept for the restaurant is being left open for the time being, says Becca Gentilli, a real estate advisor on the project. It could be a supper club, a chef-driven project or something else that fits the site, near where the Yahara River enters Lake Mendota and close to many marinas. The developers are open to whatever cuisine or style seems a good fit for the location. Outdoor seating and dedicated docks for boaters who want to come for a meal via the water are also planned. The residential development fits the nautical look and feel of Mariner’s Cove at Lighthouse Bay, the current condo development nearby. Lakestone Properties already has Lakestone Marina operating near the property. The Mariner’s Inn was opened in 1966 and was operated by the von Rutenberg Family for 59 years. It was famous for its cozy, nautical-themed bar, steaks and seafood, and hash brown potatoes. The von Rutenbergs also operated Betty Lou Cruises, a dining and lake-tour business, from a dock at the site, and the Nau-Ti-Gal, a more casual dining room and bar, across Westport Road but also on the Yahara. The Nau-Ti-Gal closed in 2022; the Mariner’s Inn followed in August 2025, as family members retired. Gentilli says that dining choices “are minimal” in the area and there are a large number of residential units nearby. “It looks like it’s out of the way, but it's smack dab in the middle of all of these other communities,” says Gentilli, including north Madison, Middleton, Waunakee and Westport. The Mariner’s Inn had solid numbers, she says, so “it made sense that another restaurant would do well there.” There’s also boat traffic, she adds, and a relatively small number of area restaurants on the lakes. The project is projected to be complete in spring 2027, Gentilli says. byLinda Falkenstein January 14, 2026 1:10 PM Development in an estuary is asking for trouble, especially if it depends on risky un-natural lake levels, or costly and eco-damaging dredging. Lake Mendota is being managed 5-8' above historical levels and ranges. The Town of Westport and other relevant government entities should instead be leading and supporting a managed retreat from this area. Checkout the facts at: https://cranesinc.org/presentations/CRANES-YLAG2-L%20Mendota%20Level%20Recs-small-v2012-03-28.pdf Jon Becker22 days ago The von Rutenberg family also ran Captain Bill's. Timby38 days ago", "date": "2026-01-14", "author": "byLinda Falkenstein", "section": "food-drink", "location": "middleton", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/madison-dining-2025-roundup/", "title": "Madison dining 2025", "text": "Food hall fun, global street food, and bubble tea byLinda Falkenstein Food & Drink January 8, 2026 8:00 AM Lizzy Larson Communal tables invite socializing and sharing at One Social District. Food halls are trending nationwide, and downtown Madison got its first one this year:One Social Districtat 123 E. Wilson St. What’s the difference between a food court — like at the mall — and a food hall? A foodhallisconceived to foster local eateriesand a convivial social space rather than house national chains. One Social’s vendors so far are creations of developer Mainstreet Ventures, with the exception ofSeñora Machetes, an offshoot of sibling — err, spouse? — restaurant Señor Machetes on East Main Street. Other vendors arePalio, Italian;Casey’s Tavern, pub food;Real Seafood Company; andOne Social Bar. The view over Lake Monona is as good as it gets and tables of diners are sharing dishes, like the $27 lobster rolls from Real Seafood Company (they do come two to an order). Affordability crisis? What affordability crisis? Despite rising menu prices, there was plenty of play in the Madison restaurant scene in 2025. The old guard One of the last of the traditional steak and seafood houses, the Mariner’s Inn, closed in August. The venerable Esquire Club, bought by Craig Spaulding in 2024, closed suddenly in March, but previous owner John Kavanaugh stepped in to re-open the restaurant. Beloved Nepali restaurant Himal Chuli, generally thought to be the first Nepalese restaurant in the United States, closed at the end of the year after four decades on State Street. While a young’un in the above company, but no newcomer at age 19, The Great Dane-Hilldale closed, citing challenges in the industry; The Great Dane’s three other area locations remain open. More old guard restaurants have uncertain futures. Porta Bella announced it was likely to close due to pending redevelopment of its Frances Street site; its sibling restaurant, Paisan’s, closed in 2022 and despite owners signaling that they were looking for a new location, that has yet to happen. In somewhat brighter news, the old Nau-ti-Gal building, housed in an historic tavern in the town of Westport, is under consideration for historic preservation status from the town. The restaurant closed in 2022 and had been slated for demolition to make way for new housing. Around the world Atico Lounge, atop the new Moxy Hotel, has a South American-influenced fusion menu.Zafferano Ristorantecombines Indian and Italian fare at the Wyndham Garden hotel in Fitchburg. Linda Falkenstein Kutty Leaf Nar Turkish Halalopened on Fordem Avenue, followed by anice cream component,Nar Turkish Ice Cream and Waffle. South IndianKutty Leafopened at 5538 Eastpark Blvd.Little Tibet Market & Cafe, an offshoot of East Johnson Street’s Little Tibet, opened in the Northgate Shopping Center. Ashirwad Indian opened on State Street. Cafe MiMi, an adorable Korean street food takeout window, launched on Allen Street. Down the block,GlouGlou Wine Bartook overThe Heights’ former space, along with a thirdCafe Domestique. Viet Townopened near East Towne; AsianHotco Noodlesnearby inside Global Market. The original Lao Laan-Xang space on Willy Street is nowSern Sappserving “Lao savories.”Izakaya Kuroyamatook over the former Dubai at 419 State St., andKorill Hut, serving Korean BBQ and hot pot, opened at 232 East Towne Way, andHaven, Asian fare and karaoke, on West Gilman. Taj Indian Cuisine, one of Madison’s early Indian eateries, which closed in 2019 due to redevelopment on South Park Street, reopened in the former Borough Beer. Co., which closed in August. Also on South Park:Casa Zaragoza,from the owners of Cuco’s;andThe Walking Jerk, vegan Jamaican food inside the Black Business Hub.El Pollo Rumberoopened in the former Hookah Lounge at 77 Sirloin Strip. Sadly, Touch of Ukraine, the restaurant started by refugees from that war-torn country in 2023, closed;Union Corners Tavernopened in its place. Linda Falkenstein In Stella news Beloved Dane County Farmers’ Market vendorStella’s Bakeryopened a cafe on Regent Street. Stellie’s Ice Creamopened in the old CocoVaa. Meanwhile CocoVaa moved to 10 Odana Court. The Monroe Street shuffle Alimentariclosed on Brearly Street as its building was torn down for redevelopment; it moved into a former Roman Candle on Monroe Street. Meanwhile sibling restaurant A Pig in a Fur Coat closed, and is slated to become the new east-side Alimentari. Miko Poke closed and was replaced byHWY1, a Baja-inspired bowl and burrito stop. One and Only closed in May; it’s slated to become a new concept from Bloom Bake Shop.Fya Syde Kitchenmoved into the old Taberna Tacos & Tequila. Further shuffling: After opening a new location on King Street,Mishqui Peruvianclosed its original location on Monona Drive; that’s slated to become the new home ofHot’n Spicy, a takeout currently operating out of the Viet Hoa Market next door. Hand-made noodle eateryTaigu, which opened a second location in the old Knoche’s Meat Market on Old Middleton Road last year, closed its original location on Elmside Boulevard in Middleton. Novanta closed;Osteria Novella,Amalfi Coast-inspired Italian from Giovanni Novella, former chef at Bar Corallini, opened in its place. Sweets, coffee and tea The bubble tea era continues.Little Sweet, an Asian snack, bakery, and bubble tea eatery, opened at 313 State St.Dreamy Teazy, 1297 N. Sherman Ave., specializes in banh mi, boba teas, and savory southeast Asian dishes.Ellipse Coffee & Crepes, 430 State, serves sweet and savory crepes, coffee, tea and smoothies.Nano Sweet Cafeon Mineral Point Road specializes in Middle Eastern sweets. Brick-and-mortars were opened byPaleo Mama Bakery, on South Park Street in a former Barriques, and veganLevel 5 Donuts, 2086 Atwood Ave. JavaAbilitiesopened on Monona Drive,Qamaria Yemeni Coffeeon Odana Road, andRasta Baristain the Black Business Hub. A fourthColectivoopened at 836 Williamson St. Did someone ask for this? Custom Mac and Cheese Bar, with build-your-own macaroni and cheese bowls, opened in that old house that used to be, I wanna say, Educational Travel? on Frances Street. When it comes to comfort food, apparently this is no time for restraint. Et alia Orchard, the new venture from the owners of The Cider Farm (which closed in Madison at the end of 2024) opened in Verona. Monkeyshines becameCornerstone Bar & Grill,Moon Baropened in the former Danny’s Pub on West Gilman Street, andGreen Room Public Housereplaced The Wedge in Schenk’s Corners Mexli Mexican Breakfastopened in the old Grand Pagoda (and a lot of other short-lived restaurants) space on Todd Drive.Gyro Guyzopened near Woodman’s West. In chain news,Teriyaki Madnessopened near West Towne serving Asian-inspired bowls;Cooper’s Hawk Winery and Restaurantopened near Middleton Station. Gobi Hotpot and Mongolian Grill(not a chain) opened at 610 Junction Road. Finally, 107 State, Bel Air Cantina, Bonefish Grill, Cafe La Bellitalia, El Rancho Breakfast and Taco, Fresh Mart-west, Outback Steakhouse, Rue Bourre,Short Stack, and Tutto with a Touch of Sass all closed. Editor’s note: The growing communities near Madison had even more restaurant openings and closings, but this roundup is focused primarily on Madison. byLinda Falkenstein January 8, 2026 8:00 AM", "date": "2026-01-08", "author": "byLinda Falkenstein", "section": "food-drink", "location": "state street", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/new-restaurant-friends-applaud-planned/", "title": "New restaurant ‘Friends Applaud’ planned for Gilson Street", "text": "Owners plan to infuse eatery with ‘mysigt,’ a Swedish term for coziness and warmth byLauren Hafeman Food & Drink December 11, 2025 4:30 PM Tommy Washbush The exterior of 1602 Gilson St. “This is the beginning of a big adventure for us,” Adam Benedetto said to a group of about 15 community members at a Dec. 9 informational meeting where he and his wife, Sacha, outlined early plans for their new restaurant, Friends Applaud. Friends Applaud will be located at 1602 Gilson St. in Madison’s Bay Creek neighborhood, tucked between South Park Street and John Nolen Drive. The space was formerly Black Rose Blending Co. and, before that, Funk Factory Geuzeria — specialty beer taprooms with bar-style layouts. The space needs to be renovated to function as a restaurant; first, by installing a kitchen. The couple will appear before Madison’s Alcohol License Review Committee on Dec. 17 for liquor license approval, and then begin discussions with the city’s fire and health departments to learn what kitchen appliances are allowed in the space. That decision will ultimately determine the menu, Adam said, noting that he has lots of ideas. “I like all types of great food, I’m very flexible with it,” he said. Updates to the indoor and outdoor seating and decor are also in the works, and Adam plans to redesign and construct the space on his own. They hope to open in March 2026. “Adam has amazing illustrations, from seating to what’s going on the walls, to colors and materials,” Sacha said. Sacha, who is Swedish, wants to infuse Friends Applaud withmysigt, an adjective the Swedish use to describe feelings of coziness, warmth and relaxation. “For me, it’s all about the environment and the feeling that it brings,” said Sacha. “That includes cozy furniture, colors and lighting; the warmth of the space, and the feeling of being at ease or at home. We are striving to make it asmysigtas possible.” A woman gestured to the small indoor seating space and asked how many patrons they expect to seat. “I have New York sensibilities about space,” Adam said. “I believe we can sit 40 in here comfortably.” Though the menu is undetermined, the couple hinted at a few items they hope to share, including pão de queijo (Brazilian cheese bread), raclette (cheese that is melted in its wheel and paired with breads, vegetables and meats), Sabine salad (a weekly rotation of specialty salads, named after Sacha’s sister, Sabine), pudding and pasta. Adam envisions his homemade pasta being dried and displayed in the glass cooler near the entrance of the space. Adam was a waiter and manager at Restaurant Magnus and ran for sheriff of Dane County in 2002. He moved from Madison in 2007, traveled a bit, and then moved to New York, where he met Sacha and managed the restaurant Jeffery’s Grocery. The couple relocated to Portland, Oregon, for a few years, but decided to move back to Madison during the pandemic. The day after they moved, Sacha said, Adam was online looking for restaurant spaces to rent. Adam is also a poet and a world traveller and his experiences around the globe have influenced his culinary tastes. The name for the restaurant, Friends Applaud, draws inspiration from what is widely believed to have been Ludwig van Beethoven’s last words: “Applaud friends, the comedy is over.” “We’re really excited to be in this part of the neighborhood, in this part of Madison,” said Adam. “We’re excited to be creating something new.” byLauren Hafeman December 11, 2025 4:30 PM Good to see something new is this space! I wish the owners success in their venture. Cheryl Roeben66 days ago", "date": "2025-12-11", "author": "byLauren Hafeman", "section": "food-drink", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/beer/giant-jones-barrel-aging-program-with-state-line/", "title": "Giant Jones develops a barrel-aging program with State Line barrels", "text": "Brewer Jessica Jones was all in on a neighborhood collab byRobin Shepard Beer December 7, 2025 7:00 AM Robin Shepard Jones with the barrels now crowding the brewery. Giant Jones Brewing Company’s superpower has long been strong beers with lots of flavor — barleywines, IPAs, double stouts and big Belgians. But until recently, brewmaster Jessica Jones has been reluctant to dive into barrel-aging, in part because of the storage space it requires. The brewery, at Main and Brearly, is already crowded. These beers may age a year or more, and barrels cannot be easily moved once full. But, Jones says, barrel-aging was “one more itch to scratch, and I knew I would become obsessed with it.” She loves how barrel-aging adds complex layers of wood and spirit flavor, especially to bigger beers. A chance to create something new and different with John Mleziva, founder of nearby State Line Distillery, prompted her entry into barrel-aging. Mleziva initially offered a single oak barrel for Jones to experiment with. The barrel was from the distillery’s first batch of single malt whiskey in 2023. “I couldn’t pass up that barrel and the opportunity to do this with John. This is about neighborhood collaboration,” says Jones, who employs only State Line’s used wooden barrels for aging. Apple Photos Clean Up Someone To Someone: a barrel-aged Belgian-style stout. Their first attempt was a strong ale, similar to a Scotch ale, released in March 2024. It was followed by an Adambier (an old German style of ale) run through the same barrel. Those pilot efforts fostered bigger ideas. Currently available is a ryewine, aged in State Line brandy barrels, spicy and bready from the rye, and warm with apple liqueur sweetness. At 10.2% ABV, it makes for a great nightcap (500 mL bottles / $10). Someone To Someone, a barrel-aged Belgian-style stout, is fermented with a Belgian yeast and barrel-aged for a year. The beer was divided into different barrels that had been used to make aquavit, rum, peated whiskey and apple brandy respectively. Once aged, the beer was all blended back together — and the flavor begins with the anise aroma of aquavit, followed by dark, fruity notes from the Belgian yeast and the rich roasted malts of the underlying stout. The rum, brandy and whiskey barrels lend hints of spirit sweetness and light woodiness. It finishes at 10.2% ABV (500 ML bottles / $9). The beer’s name comes from the album of the same name by the all-acoustic quartet from Chicago called PlainsPeak, a favorite of brewery owners Jessica and Erika Jones. A challenge in barrel-aging for Giant Jones is its commitment to being a certified organic brewery. Because State Line’s spirits are not MOSA Certified Organic, Jones calls the first beer from the barrels “made with organic ingredients.” If Jones uses the same barrels a second time it can be labeled as MOSA Certified Organic. Giant Jones will release four more barrel-aged beers at the brewery’s upcoming Barrel-Aged Fest, Jan. 9-10. That event also features other barrel-aged beers from Madison breweries. Later in 2026, Giant Jones will release two more barrel-aged gems: its Belgian quadruple from rum barrels, and its Grand Porter, aged in rye whiskey barrels. byRobin Shepard December 7, 2025 7:00 AM", "date": "2025-12-07", "author": "byRobin Shepard", "section": "food-drink", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/where-to-find-free-thanksgiving-meals-in-Madison/", "title": "Where to find free Thanksgiving meals in Madison", "text": "Share community and cranberries with others byIsthmus Staff Food & Drink November 19, 2025 11:30 AM Megan Watson/Unsplash Thanksgiving dinners skew traditional, but there are options. It’s not been a good year so far for folks who’ve been hit hard by job losses, the government shutdown, and especially the disruption in SNAP benefits. Fortunately caring members of the community want to share the harvest so everyone can enjoy a traditional Thanksgiving meal. There are various drop-in meals on the holiday, and advance sign-ups for pickup or delivery options. First Congregational United Church of Christ-Madisonserves the traditional Thanksgiving meal via delivery or pick up at the church on Thanksgiving between noon and 3 p.m. RSVP required; call 608-233-9751 or gohereby 5 p.m. Nov. 20 to place your order. Slice's Bar & Grillserves a pay-what-you-can traditional Thanksgiving dinner either carryout or dine-in; either way you must call the bar at 608-243-6925 by Nov. 21 to reserve a meal. Dine-in serving time is 4:30 p.m. CheckFacebookfor updates. The free weekday meal program atCatholic Multicultural Center, 1862 Beld St., will not be open on Thanksgiving or the following Friday, but will celebrate the holiday at the Wednesday, Nov. 26, meal, at 4 p.m. Good Shepherd Lutheran Church,5701 Raymond Road, hosts its traditional free Thanksgiving meal from 11 a.m.-1 p.m. No RSVP necessary. Lakeview Lutheran Church, 4001 Mandrake Road, is serving Thanksgiving dinner at noon; RSVP required at 608-244-6181. A free meal hosted by Neighborhood Food Solutions founder Robert Pierce takes place atMadison Labor Templefrom 1-4 p.m.; RSVP at 608-358-5834. House of Flavas and Devine Grilling host a meal at theBlack Business Hub, 2352 S. Park St., 2-4 p.m. No registration needed. Luke House, 310 S. Ingersoll St., hosts a Thanksgiving meal from 3-4 p.m. Delta Beer Lab’s community Thanksgiving is a traditional turkey dinner served cafeteria style, from 3-5 p.m. The first 150 people to call Delta at 608-640-4500 or registerherewill be prioritized for food, others will be admitted after. TheCardinal Baris hosting “Not Your Family’s Thanksgiving Dinner” from 5-10 p.m., pay-what-you-can. Editor's note: Updated with more meals on Nov. 25. byIsthmus Staff November 19, 2025 11:30 AM Catholic Multicultural Center will have Thanksgiving meal on Wednesday, November 26th starting at 4:00m. You can reach out Becca Schwartz to get more information about this. Joshy Castillo93 days ago", "date": "2025-11-19", "author": "byIsthmus Staff", "section": "food-drink", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/beer/the-herbiery-reopens/", "title": "The Herbiery reopens", "text": "The Schenk's Corners taproom for the herb-based brewery is back with limited hours byRobin Shepard Beer August 25, 2025 2:00 PM Nia Ryan, left, and Lauren Virnoche have reopened the Herbiery Taproom at 2015 Winnebago St. TheHerbieryhas reopened at 2015 Winnebago St. The brewing company that makes beer with herbs instead of hops closed its taproom earlier this year after failing to generate enough business. But owner Nia Ryan, who was “never willing to let it go,” has now teamed up with Lauren Virnoche, owner ofEcotone Herbs. Ecotone manages several farm fields in northern Illinois and southwestern Wisconsin, and Virnoche supplied herbs and fruits to the Herbiery before it took its temporary hiatus. “Having a partner with the same interest in herbs made me want to continue,” says Ryan. The taproom looks the same but its beers and menu have been changed. Ryan and Virnoche collaborated with Madison’sDelta Beer Labon what may become Herbiery’s new flagship beer, a farmhouse ale called Field and Forage made with yarrow, creeping charlie, flaked oats and rye berries. It is a bright hazy yellow and carries a soft subtle fruitiness, woody herbaceous notes, and finishes at just 5% ABV. The beer has a clear range of flavors with an overall earthiness that leans into the name Field and Forage. Field and Forage will also function as a base beer to which different combinations of herbs, flowers and spices will be added. Currently, one of those variants is made with elderflowers and lemon balm; another has ginger grass and nettles. Ryan is also experimenting, at least temporarily, with a limited version of Field and Forage made with Saaz hops, along with hemp and conifer tips. These variants are available in the Herbiery taproom and make interesting side-by-side taste comparisons ($7/glass; 16-ounce cans will appear in early October). Other changes include house-brewed kombucha and herbal teas. There is also a limited food menu that changes based on what’s available in local markets. The Herbiery is open 4-9 p.m. Fridays, 1-6 p.m. Saturdays and 4-9 p.m. the first Monday of each month. byRobin Shepard August 25, 2025 2:00 PM", "date": "2025-08-25", "author": "byRobin Shepard", "section": "food-drink/beer", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/beer/a-dozen-biergartens-not-to-miss/", "title": "A dozen Madison biergartens not to miss", "text": "Summer calls for outdoor spaces with a communal vibe byRobin Shepard Beer June 7, 2025 8:00 AM Courtesy Tyranena A Lake Mills classic: Tyranena at sunset. Biergarten season has arrived. Since 2020’s COVID restrictions forced creative solutions, outside seating at breweries and brewpubs has become a staple. But what separates run-of-the-mill outdoor seating from something approaching the spirit of a real German biergarten? A biergarten is not a few tables on the sidewalk with a view of traffic. A biergarten is an atmospheric achievement. It is an outdoor space with a communal vibe. Its sense of place is as distinctive as a public park. They are family- and pet-friendly. Live music is a plus. Sometimes, if there’s no onsite kitchen, patrons can bring in food, and these days, food trucks often line up nearby. Capital Brewery and Bier Gartenat 7734 Terrace Ave. in Middleton is true to its name. This is a classic brewery biergarten with rows of picnic tables, served by an outdoor bar. A covered performance stage is the perfect setting for a summer’s worth oflive musicon Fridays and Saturdays (and sometimes other days). About 15 beers are on tap. Pick:Capital Special, a crisp German pilsner, is one of Capital’s original Garten Brau beers from the 1980s. Tyranena Brewing Companyat 1025 Owen St. in Lake Mills has a sprawling lawn where folks spread blankets and settle in with a beer to listen tolive musicon Fridays and Saturdays in the summer. There’s also a covered porch and patio seating — a safe harbor when poor weather sets in. The backyard feel. coupled with the quality music and beer, makes the trip to charming Lake Mills worth taking. About 15 beers are on tap. Pick:Lake Millionaire, a hazy IPA, has crisp tropical citrus flavor. You might know this place as the Wisconsin Brewing Company, but since WBC acquired Lake Louie in 2019, that branding has come to the fore.Lake Louie Brewing, at 1079 American Way in Verona, has a large patio overlooking a seven-acre man-made lake they call Lake Louie (though it’s not the body of water in Arena that originally gave the brewery its name). The patio is home to special events, parties andmusicon Fridays and Saturdays (and some other days) during the summer. There are 13 taps. Pick:Pier Pressure, a new beer for Lake Louie. This is a light crisp pilsner dry-hopped with German Spalt hops that lend spicy herbal bitterness. There’s no brewery attached toThe Biergarten at Olbrich Park, 3527 Atwood Ave. — but there’s plenty of great brews on the almost-exclusively-Wisconsin craft beer tap list. The view of Lake Monona and the skyline is unsurpassed; the tables are so close to the shoreline that on windy days you can feel the spray from waves. (A subtle touch of German biergarten authenticity lies under the picnic tables — it’s gravel similar to what’s underfoot in biergartens in Bavaria.) Pick:Third Space’sHappy Place, if for no greater reason than the name. This is a citrusy pale ale that’s a real people-pleaser. TheGreat Dane Pub and Breweryat 123 E. Doty St. in downtown Madison has a secluded garden courtyard that’s popular for drinkinganddining, so it lacks the more social biergarten vibe. Even so, the cream brick and ivy-covered walls lend plenty of atmosphere. Pick:Crop Circle Wheat is among the best local hefeweizens, light and crisp and full of fruity, yeasty notes of lemon and banana. The rooftop patio ofThe Lone Girl Brewing Companyat 114 E. Main St. in Waunakee makes this a destination. A covered bar and fire pits are joined by a small stage for occasional live music. Pick:Off the Rail IPA, an American IPA with sharp, resiny bitterness. Vintage Brewing Company’s Sauk Prairie location at 600 Water St. has a balcony-like patio that overlooks the Wisconsin River. Plus, there are about 40 beers on tap. Pick:Sister Golden, a light, easy drinking German kölsch. Any self-respecting biergarten needs to serve this traditional style, and it’s a signature brew for Vintage. Hop Haus Brewing Companyat 2975 Sub-Zero Parkway in Fitchburg features both a patio and a rooftop deck with a full bar. About 16 taps are available. Pick:Hammock Naps, a fruited sour that stays refreshing in the sun. Its tartness is balanced with a touch of mango and peach for some fruity sweetness. Honorable mentions:Here are a few more biergartens to put on your bucket (or barrel) list:New Glarus Brewing Company, 218 Hosely Drive, has a large outdoor courtyard perfect for a beer before or after a self-guided tour. Paoli’sHop Gardentaproom, 6889 Canal St., in the century-old mill (listed on the National Registry of Historic Places) is adjacent to a family-friendly park-like setting on the Sugar River, where live music is performed Wednesday-Sunday. Out-of-the-wayHubbleton Brewing Companyis really out in the country at W10445 Hubbleton Road, Waterloo. Its small covered patio overlooks the brewery hopyard and rolling Wisconsin farmland. And of course theTerrace at the Memorial Union, 800 Langdon St., is in a class of its own, with sunsets that rival the beer list.. byRobin Shepard June 7, 2025 8:00 AM", "date": "2025-06-07", "author": "byRobin Shepard", "section": "food-drink/beer", "location": "downtown", "source": "isthmus"}
{"url": "https://isthmus.com/food-drink/dining/global-culinary-tour-within-madison/", "title": "Around the world in eight restaurants", "text": "It’s easy to embrace global tastes without leaving Madison byCandice Wagener Isthmus Dining August 4, 2020 9:00 AM Carolyn Fath Ashby Crisp filled pupusas and tart curtido slaw come from El Salvador via Finca Coffee. As much as it would be nice to be able to hop on a plane any time to experience new sights or tastes from around the world, we don’t always have the money or time to make that happen. And now of course, we can't feasibly do it at all. The good news is that many of the world’s flavors exist right here in Madison. It’s possible to take a culinary tour through Central and South America, hopscotch across Europe to the eastern tip of Africa, and leapfrog over the Himalayas to Southeast Asia, while utilizing only Madison Metro. While many Latin American cuisines may seem similar, there are influences by country and region that set them apart. Salvadoran cuisine is influenced by the country’s indigenous Mayan-Pipil peoples as well as its Spanish colonizers. It employs fresh fruits and vegetables, and the ingredients speak for themselves, in simpler presentations. Marleni Valle is bringing Madisonians a taste of El Salvador atFinca Coffee, the cafe that’s part of the Novation Campus on Madison’s south side. Her quesadillas are not the Mexican variety familiar to Americans; these are more like delicate corn muffins. The pupusas are thick, handmade rounds made from masa harina (ground nixtamalized corn), that are stuffed, sealed and grilled until slightly crisp. Fillings include beans, cheese, and slow-roasted, shredded pork, all wise choices. They’re accompanied by a tart cabbage-jalapeno slaw called curtido and a thin, tomato-based salsa for dipping. Finca is part of a pilot program developed by The Alexander Company, which aims to bring more diversity to the entrepreneurial market; in this case, it’s also brought diversity to our restaurant scene. Finca is currently open for takeout, indoor and patio dining. See updates on itsFacebookpage. La Taguarais no longer Wisconsin’s only Venezuelan restaurant, but it was a pioneer when it opened in a former gyro joint on East Washington Avenue in 2013. In Venezuela, there is again a focus on preparing ingredients simply. The cuisine has been influenced by the foods of the country’s indigenous peoples, European explorers and colonizers (Spanish, Italian, French), with African touches as well. Arepas are a signature item at La Taguara. They differ from pupusas in that they’re made with masarepa, a precooked corn flour (it’s a somewhat lighter corn flavor), and griddled before the filling is added. At La Taguara, the arepa is a pocket bursting with a choice of ingredients: cheese, ham, roast pork, shredded chicken, ground beef, black beans, shredded beef, even shredded eggplant. The roast pork —pernil— is traditionally marinated in a wine sauce seasoned with rosemary, thyme and oregano. The shredded beef —pabellón— is considered the country’s national dish. The accompanying green sauce is guasacaca, divinely creamy from avocado and perfect for dipping. La Taguara's dining room is once again open, or you can orderonlinefor pickup or delivery. French cafes are small, intimate celebrations of the country’s cuisine. The quaint, homey dining room at Willy Street’sLa Kitchenetteis arranged mostly in tables for two. Here, buckwheat crepes are mostly savory, filled with rich proteins (prosciutto, bacon or smoked salmon), classic cheeses, and often topped with either a fried egg or bechamel sauce. Sweet crepes come with tangy lemon curd or creamy Nutella. Frédéric Bouché Lavender is an extra French touch atop the crème brûlée at La Kitchenette. La Kitchenette may be best known for its lavender crème brûlée. Yes, it’s a dessert custard, but made elegant with a caramelized, hardened sugar crust. Fragrant vanilla joins a floral hint of lavender in the custard; the dessert is also sprinkled with dried lavender. La Kitchenette is open for takeout only as of this posting; orderonline. Faycal Belakhdar’s much-lovedMediterranean Cafeshowcases his Algerian roots as well as Greek, Mediterranean and Middle Eastern dishes. The cafe has been serving healthy, delicious, low-cost meals on State Street for over 20 years, always offering vegetarian options. In fancier surroundings, Belakhdar could probably charge twice as much for every dish. But the diners who crowd the place every noon (the cafe is not open for dinner) don’t mind its modest, student-centric vibe. Med Cafe’s great strength is its rotation of daily specials, written on a chalkboard up front and shared on the restaurant’s Facebook page. Thursday seems to be the day for chicken apricot pie, a variation on lasagna or moussaka. Seasoned roasted chicken is layered with rice, dried apricots, and sliced almonds; it’s all topped with a fluffy bechamel. It’s the perfect trifecta of sweet, salty and meaty. Mediterranean Cafe is open for takeout, curbside pickup and delivery. Orderonline. Menu specials are largely Thursday-Saturday. Buraka, on the Madison dining scene in one way or another since the early 1990s, is currently the only spot in town to get Ethiopian fare. Owner Markos Regassa runs a brick-and-mortar restaurant on Williamson Street and a food cart. With its mountainous terrain, Ethiopia has stayed protected from outside influences when it comes to culture and cuisine. However, trade routes between Europe and the Far East brought spices into the region, which Ethiopian cooks rely on for preserving meat (due to limited access to refrigeration). The most popular, can’t-miss dish here is the dorowot, a hearty stew of chicken and carrots in a rich red sauce. It’s enhanced with a blend of spices called berbere — the heat comes from chilies, augmented by ginger, garlic, coriander, cumin and other spices. Although dorowot can be served on rice, get it with the more traditional injera, a spongy, sour flatbread used to scoop up stews and meat. Eric Tadsen Ethiopian dorowot is popular with the injera at Buraka. Home of the storied “Spice Islands,” Indonesia remains one of the world’s top producers of spices. It’s fitting that many of the country’s traditional dishes are quite aromatic; more influences come from nearby China, Thailand and Vietnam. Buraka is open for indoor and patio dining, takeout and delivery. Bandung, on Williamson Street, serves traditional Indonesian cuisine, plus the occasional shake-up of tradition. The Indo Mac is a fun play on words, but it doesn’t really resemble American mac and cheese. Thick rice noodles, green and yellow onion, bamboo shoots and mushrooms are stir fried and mixed with a creamy red curry sauce that’s both spicy and soothing. Consider choosing the housemade tempeh as your protein. The fermented soybeans are served fried in small bites in this dish. Even if you’re a full-on carnivore, you’ll appreciate the smoky nuttiness of this meatless powerhouse. Bandung is offering takeout and delivery as of this posting. Little Tibetfocuses on serving Himalayan specialties from Bhutan, Nepal and Tibet. The cuisine of Bhutan, a small country on the eastern edge of the Himalayas, is seldom seen in restaurants in the U.S. While it bears some resemblance to Nepalese and Tibetan food, it is spicier, with very hot peppers in most dishes. The Bhutanese ema datshi, a stew of chilies and cheese, is considered the national dish of Bhutan. Little Tibet, located on East Johnson Street, offers several variations of the dish, including shakam datshi, made with a homemade beef jerky. This is much thicker, yet less chewy, than American jerky. The beef is simmered in a white sauce thickened with creamy gouda and sharp blue cheese, with plenty of heat from Thai chilies and jalapeños. There’s a nice addition of daikon radish, too. Unless you’re Bhutanese, or one of the lucky few who are able to travel to Bhutan, this could be one of the few places you can try datshi. Little Tibet is open for takeout and delivery as of this posting. [Editor's note: This story was originally written to publish in the Isthmus Dining special section in April. Restaurant details have been updated to correspond with each restaurant's current status during the COVID-19 restrictions.] byCandice Wagener August 4, 2020 9:00 AM A tantalizing guide to dining-around-the-globe in Madison! My mouth is watering already, and I can’t wait to saddle up/hop aboard/summon EatStreet’s drivers to taste all of these delectable cuisines. Some of them I can already vouch for—La Kitchennette, for example, La Taguara, and of course the tried-and-true Mediterranean Cafe. Don’t overlook the Monona Bakery and Eatery, with its Honduran breakfast (and dinner) and authentic Tres Leches cake. Fawn Bilgeremore than 5 years ago", "date": "2020-08-04", "author": "byCandice Wagener", "section": "food-drink/dining", "location": "state street", "source": "isthmus"}
{"url": "https://isthmus.com/opinion/citizen-dave/madison-schools-sticker-shock/", "title": "Madison schools sticker shock", "text": "Much of the tax increase this year is due to the $607 million referendum passed in November 2024 byDave Cieslewicz Citizen Dave December 22, 2025 8:00 AM Freepik I follow this pretty closely, so I knew it was coming. But I wonder how many Madison homeowners had a rude awakening last week when they opened their property tax bills. Taxes on the average house here went up by around $800 or 11%. And almost all of that increase is due to the $607 million in new taxes voters approved with an almost 70% “yes” vote on two referendums in November 2024. The school board rushed those referendums to the presidential ballot because they knew there would be a massive turnout of liberal voters, most of whom did not follow local issues. Liberals showed up en masse to vote for Kamala Harris and against Donald Trump and while there, they noticed there was an opportunity to also show their support for public schools. It was a no-brainer — in so many unfortunate ways. There was a lot wrong with those referendums, but the flagship of bad policy was the new Shabazz/Sherman building. That's the school building on the north side which houses Sherman Middle School and Malcolm Shabazz High School. Enrollment in both schools has been declining and is projected to continue to go down for the foreseeable future. In fact, Shabazz has only about 114 students, which should raise questions about why the school exists at all. The logical thing to do would have been to close the schools and redraw the attendance maps. Instead, the school board proposed a new, bigger building. In fact, at $108 million it was the single biggest item in the $507 million capital referendum. And now, after the fact, MMSD is doing an attendance boundary study. This is madness. But with no organized opposition to the hard-left in Madison, this issue and others like it were hardly raised in the mainstream media. I did write an op-ed in theState Journaland I tried to raise the alarm in this space, but that was pretty much all there was in terms of a dissenting voice. And now it's time to pay up. And here's a rich irony. Madison officials talk endlessly about affordability while supporting referendums that increase property taxes at three times the rate of inflation, something that will also soon be reflected in rents. The one certain thing local government can really do to keep housing costs down is to restrain property taxes. And we're going vigorously in the other direction. Finally, there's a question of what we get for our money. Again because there is no loyal opposition, there was no demand for accountability in the spending. The school board promised taxpayers absolutely nothing in terms of improved test scores, less violence and better behavior in the classroom, or a narrowing of the racial achievement gap. They did spend $100,000 on a new MMSD logo, so we got that. Will this sticker shock finally result in some sort of accountability movement? I wouldn't bet on it. In a government town a lot of voters aren't going to vote against more money for government. And among liberals, public schools are the closest thing to a sacrament. Liberals would sooner forgo kale and MS NOW before they'd vote against a school referendum, no matter how many facts you throw at them. I literally had people tell me that they saw my arguments, agreed with them, but “I just could never vote against a school referendum.” It’s like religion. So, my guess is we're just going to slog along like this. We'll talk and talk and talk about how much we care about public education while blithely accepting terrible performance in our schools. We'll blather on endlessly about the cost of housing while voting for 11% property tax increases. Madison's famous separation from reality grows wider. Dave Cieslewicz is a Madison- and Upper Peninsula-based writer who served as mayor of Madison from 2003 to 2011. You can read more of his work atYellow Stripes & Dead Armadillos. byDave Cieslewicz December 22, 2025 8:00 AM Dave, do you think the defunding that's been happening at the state level due to the extreme conservatives have been doing to public education since 2010 has anything to do with the need to go to referendum or any dismal stats coming from the public schools?  What about that surplus they are hanging on to?  We are effectively paying twice, when our original taxes should have gone to the schools in the first place.  Also, we are anticipating and indeed building for an influx of people into this City so abandoning one school building won't make sense in the long run.  It just drives me crazy to hear people complain about taxes when our money is all being given up to corporations or to compensate for bad policies.  It turns out you don't know everything about public schools. Debbie55 days ago New buildings can't fix inherent dysfunction in the system. Erik58 days ago", "date": "2025-12-22", "author": "byDave Cieslewicz", "section": "opinion", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/music/madison-opera-premiere-everlasting-faint/", "title": "Madison Opera’s premiere of ‘Everlasting Faint’ engages with history — and the present moment", "text": "A mom seeks justice for her daughter byLinda Falkenstein Music February 4, 2026 1:30 PM Director Keturah Stickann, left, librettist Sandra Flores-Strand and composer Scott Gendel. “Women die at the hands of men,” says Keturah Stickann, director ofMadison Opera’s forthcoming premiere ofEverlasting Faint. “That's actually a line in the opera. It's an important theme and something that we should be continually examining in our culture. Why does this keep happening?” Just two years afterEverlasting Faint, a new opera based on a centuries-old Appalachian murder, was firstpresented in a sung “reading”by University Opera, it’s premiering as a full-fledged production. That’s a rapid progression, as these things go. With music by Madison’s Scott Gendel and libretto by Sandra Flores-Strand,Everlasting Faintis based on the true story of a 19th century murder in Greenbrier County, West Virginia. When Elva Zona Heaster Shue was found dead in 1897, the cause of death was recorded as childbirth. Later, Shue’s ghost appeared to her mother, Mary Jane Heaster, declaring she’d been murdered by her husband. (An “everlasting faint” is a 19th-century term for a sudden, unexplained death.) Ultimately her body was exhumed and an autopsy performed, which revealed her neck had been broken and her windpipe crushed. Her husband was eventually convicted of her murder. “I like the absolute American sound of it,” says Stickann, a New York-based opera director and choreographer who has worked with Madison Opera before. “This is true American mythology.” It’s not just the story that feels American, Stickann says. “The musical ideas that Scott put into it have such an Americana feel to them. Those of us working in new opera often talk about finding the American voice in opera, because it’s notoriously French and Italian and German. This feels like an opera that truly has an American voice.” Being the first to stage an opera is “exhilarating,” says Stickann. “You get to make of it whatever you want, without anybody saying ‘It's usually done this way.’ It's the same thing for the singers who are creating the role. That's an incredible opportunity to allow your voice to be the one that is thought of when people think about how the show should be put together.” Librettist Sandra Flores-Strand, who’s written several operas focused on the lives of women and immigrants, discovered the story of the Greenbrier Ghost while researching another opera. She saw it referred to as the “first court case in history to be won based on the testimony of a ghost,” and delved into the legend, quickly sketching out the idea for the whole opera. “I got a lot of positive feedback [after the University Opera reading] and I felt like the story resonated because it parallels so closely to what we see in the news,” says Flores-Strand. Other feedback led Gendel and Flores-Strand to clarify some plot points and simplify the music for the prologues, sung by a young boy, before each act. The two say this is a good opera for a first-timer or a regular opera-goer. “A lot of what Sandra and I were aiming for in this piece was to tackle serious issues, but also make it very entertaining and exciting,” says Gendel. “We have easy ways for people to get into it — for instance ghosts and a drinking song.” But at the same time, darker subjects run through the whole work. In “That Devil Killed Her,” Mary Jane Heaster — really the heart of the opera — sings about her daughter’s death over dissonant, disturbing music: “That devil killed her and knew he’d get away with it…. When men fall, they raise statues. For women, they lay flowers. Which do we remember most? Immortal figures…or wilted ones?” Gendel reminds those who may be hesitant about opera that this one is sung in English and that it “moves at the pace that 21st century media moves. It’s so direct and emotionally engaged there's no need to be afraid. Except of the ghosts. You have to be afraid of the ghosts.” Madison Opera presents the world premiere ofEverlasting FaintFeb. 13 and 15 in the Overture Center-Capitol Theater. byLinda Falkenstein February 4, 2026 1:30 PM", "date": "2026-02-04", "author": "byLinda Falkenstein", "section": "opinion", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/music/the-hunt-for-harry-styles-madison-listening-party/", "title": "The hunt for Harry Styles’ Madison listening party", "text": "We caught up with expectant, excited fans at Lola’s on North Sherman Avenue byLiam Beran,Lauren Hafeman Music February 19, 2026 8:50 AM Lizzy Larson Around 6:30 p.m., there were nearly 100 people in line to hear Styles' new album. The announcement last week that Madison and Los Angeles would be the only two U.S. cities hosting listening parties for British superstar Harry Styles’ new albumKiss All the Time. Disco, Occasionally., dropping March 6, lacked some important details. Styles’ team kept the location of the event secret until hours before it started. His record label did not respond to a request for comment. Only 100 people got invited to the event and we were not among the lucky ones. Desperate, we started messaging people on TikTok and Reddit to see what we could learn. Just one contact worked out: Caroline Accetta, who grew up in Milwaukee, posted a TikTok on Monday announcing she had won tickets to the listening party. She agreed to a phone interview, describing herself as “Harry’s biggest fan.” Accetta says she has been to 14 of Styles’ concerts and “thought she was being pranked” when she received the email invitation. “He has been with me through so many parts of life,” says Accetta. “I’m so grateful that we can keep doing this together.” Less than 24 hours before the party, Accetta still hadn’t been notified of the location. “There has got to be enough room to dance becauseDisco, Occasionallyis in the name of the album,” she says. “Maybe the Majestic?” Styles first broke into the international scene as part of boy band One Direction. When the band went on indefinite hiatus in 2016, he released his self-titled first solo album in 2017 and followed up with subsequent releases in 2019 and 2022. Beyond his music, a mix of warm pop and soaring ballads, Styles’ international superstar status has also been bolstered by his flamboyant, gender-ambiguous fashion sense. Accetta tentatively agreed to share the location when she received it, but text messages to her in the few hours prior to the event went unanswered. With no other options, we started visiting all the Madison venues we considered likely spots. Nothing was happening at the Sylvee, High Noon Saloon, Majestic or Strictly Discs music store on Monroe Street. But at the last moment, we received an anonymous tip: Lola’s Hi/Lo Lounge on North Sherman Avenueposted on InstagramWednesday afternoon that it would host a “private event” and be closed to the general public in the evening. We scrambled to get there, making it by 6:10 p.m., still 20 minutes before the event's 6:30 p.m. check-in time. The view through the windows was completely obscured by black curtains, though the phrase “We Belong Together,” part of the album’s marketing, was pasted on the glass. Two young men, both wearing shirts displaying those words, were operating video cameras by the door. An older employee, ostensibly event staff, eyed us suspiciously as we walked up. We identified ourselves as reporters and asked if this was the Harry Styles event. “Yeah,” he said, somewhat uncomfortably. He said he would go inside and “find someone” for us to chat with. After about two minutes, he came back and said that “it’s a private event and there’s a list.” Implication: Go away. We decided to wait it out at the nearby Drackenberg’s Cigar Bar, where the bartender gave us a warm welcome. Around 10 minutes later, we noticed through the windows two women walking by in flashy dresses — a little too dolled-up for Wednesday evening at the strip mall. We dashed out the door and were met with a line of nearly 100 people. Translation: Harry (‘s album) is here. Those in line were ecstatic to have made the cut for the listening party. Longtime friends Maria Sadowske — the woman wearing the sequin dress — and Lauren Murray have each other saved as “Harry Styles” in their phones (sometimes they pretend that, when they’re texting each other, they’re actually texting the star). Both Milwaukee residents, they say they’ve been listening to Styles since One Direction’s “X Factor” days in 2010. “We were literally driving to the [Milwaukee County] zoo to meet at the zoo with our kids. We got out of the car and just had, like, a two-minute dance party because we were freaking out,” says Sadowske. Sisters Patricia Rivera Torres, 25, and Amanda Rivera Torres, 23, say they were bewildered to receive tickets, and to see that Madison, where they’ve grown up, was one of two cities in the nation selected for a listening party. They’ve both been listening to Styles since around 2012, when they first saw him at Miller Park as part of One Direction. “Never in a million years would I even think he would have come to Madison,” says Patricia. “It's just really cool to be able to experience this in our own hometown.” Lizzy Larson Sisters Patricia Rivera-Torres, right, and Amanda Rivera-Torres grew up in Madison. Says Patricia: 'It's just really cool to be able to experience this in our own hometown.' Noah Showalter, one of the few men in line, was still waiting at 6:40 for a friend to arrive. He’d been spending the day wondering where he’d end up that night. “There was lots of theorizing between my friends and I about where it was going to be,” says Showalter, who was wearing a jazzy black and white button-up shirt. “We thought, Majestic? No, too basic. A random warehouse in the middle of the cornfields? We really didn’t know.” Showalter was looking forward to meeting fellow fans: “Harry Styles creates a community where we can all converse and grow relationships with people who you don’t know. We all have mutual respect for each other because we all love the same music.” byLiam Beran,Lauren Hafeman February 19, 2026 8:50 AM", "date": "2026-02-19", "author": "byLiam Beran,Lauren Hafeman", "section": "music", "location": "monroe street", "source": "isthmus"}
{"url": "https://isthmus.com/arts/music/why-is-the-city-of-madison-spending-14-000-on-a-regional-music-brand/", "title": "Why is the city of Madison spending $14,000 on a ‘regional music brand?’", "text": "Organizers hope effort will support equity in local music scene and drive tourism byLiam Beran Music October 3, 2025 9:00 AM Hedi LaMarr Rob Dz, co-president of the Urban Community Arts Network, says developing a music brand is an 'important step' for the city. City officials are looking to promote tourism through a new marketing effort meant to pitch Madison as a “music city.” Aresolutionunanimously passed by the city council Sept. 16 authorizes the city’s planning division to enter into a contract with local marketing firm The Creative Company Inc. “to develop a regional music brand for the Greater Madison area.” The $14,060 contract is being funded through a $25,000 earmark in the city’s room tax commission budget for music tourism efforts. The Creative Company would be expected to produce a narrative statement, logos, and other marketing materials, says Angela Puerta, a city planner and local musician. Three firms were reviewed prior to The Creative Company being selected, Puerta says. Puerta says organizations like Destination Madison or Frank Productions could potentially use such marketing materials to promote events or artists and strengthen the city’s musical tourism profile — performance metrics might include increased page clicks or tourist visits. Similar efforts have been undertaken inNashvilleandAlbuquerque, she says. Making Madison’s music scene more equitable is a key goal of the project. Puerta says the process of developing the brand “will have a lot of emphasis on inclusion.” “We want to make sure that this is not to support the status quo,” says Puerta. “We want to make sure that everybody's included, every genre is included, as I said, hip-hop music or Latin music, not always the same styles that we typically hear in Wisconsin.” The brand project is meantto represent diversity in Madison’s music scene, say Karen Reece and Rob Dz, co-presidents of the Urban Community Arts Network. Reece says “we want to see people start using that brand identity.” “That might be putting it on a flyer or on a website and making sure that all different kinds of people feel like it's theirs, and feel some ownership in this music scene,” says Reece. Madison has had a troubled relationship with hip-hop acts, in particular. Throughout the last two decades, multiple venues in the city stopped booking hip-hop acts, often citing acts of violence that occurred nearby. A 2018studyconducted by UCAN and researchers at UW-Madison however, found that incidences of violence were no more common at hip-hop performances than for other genres of music. Researchers sifted through more than 4,000 police calls from live music venues from 2008 to 2016 for the study. “We went through a stretch of time where police would preemptively cancel events,” says Reece. “If they saw certain people's faces on a Facebook post related to an event, they would go directly to the [organization], to the building owner, and tell them they should cancel the event.” The Greater Madison Music City initiative was formed in early 2020, with city support, to improve equity in Madison’s music scene and study music’s economic impact on Madison and Dane County. Among recommendations the group made in a 2022reportwere that the city should create a music tourism strategy that would build “Greater Madison’s brand as a music city, increase knowledge of the city’s musical heritage, and promote local music.” Reece and Dz view the music brand project as fulfilling that recommendation. Tourism plays a key role in determining who feels at home in a city, Dz says. “If you get a kid that goes to a [historically Black college or university] and comes here for a job interview — if he doesn't see culture that looks like them, then what's the likelihood that they're going to want to come to this place?” says Dz. The Creative Company will plan a workshop to bring members of the local music scene — including artists, venue owners, business owners and more — into the brand’s development process. Both Reece and Dz hope the brand will serve as a first step toward other conversations on how to make Madison’s music scene more equitable. “It's an important step,” says Dz. “Hopefully leading with this kind of opens up the conversation to be having other areas.” byLiam Beran October 3, 2025 9:00 AM", "date": "2025-10-03", "author": "byLiam Beran", "section": "music", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/music/madison-classical-scene-embraces-the-new/", "title": "Madison’s classical scene embraces the new yet upholds tradition", "text": "‘Abstract, but beautiful’ bySandy Tabachnick Music September 4, 2025 8:00 AM Brad Budd Acrobats and film scores are center stage with Cirque de la Symphonie and Madison Symphony Orchestra. As we head into cooler days, Madison’s downtown classical music groups will keep the stage warm with world premieres, a celebration of Earth, dueling violins, and a true crime ghost story as they prepare their 2025-2026 seasons. MADISON SYMPHONY ORCHESTRA The upcoming season for theMadison Symphony Orchestrais bittersweet. It celebrates its 100th anniversary, but it’s also the final season forJohn DeMain, the MSO’s music director since 1994. DeMain says he will continue his conducting career and, if asked, will conduct a concert here and there as a guest conductor or conductor emeritus. The MSO’s centennial celebrations begin in Overture Hall on Sept. 19 with an all-Tchaikovsky program starring pianist Olga Kern. They continue on Sept. 20 with Cirque de la Symphonie, a mix of circus arts and film music. The opening concert of the MSO’s 2025-2026 subscription season happens on Oct. 17-19 in Overture Hall. The concert stars UW-Madison piano professor Christopher Taylor, soprano Jeni Houser, mezzo-soprano Emily Fons, and the Madison Symphony Chorus. On the program is Mahler’s Symphony No. 2 and Mason Bates’sResurrexit, which DeMain describes as “abstract, but beautiful.” César Franck’s Symphonic Variations features Taylor’s piano artistry. Several guest artists return. Alban Gerhardt plays Haydn’s Cello Concerto in D Major on November 21-23. Yefim Bronfman plays Brahms’ Piano Concerto No. 2 on Jan. 23-25, 2026, and Rachel Barton Pine returns on Feb. 20-22 with Korngold’s Violin Concerto in D Major. On March 20-22, Emanuel Ax plays Mozart’s Piano Concerto No. 25, a charming piece that shows off Ax’s clean, delicate touch. Spanish rhythms take center stage on April 10-12 with the Los Angeles Guitar Quartet. The season features many 21st-century compositions, including a newly commissioned work by Jake Heggie.EARTH: A Choral Symphony, gets its world premiere in the final concert of the season on May 1-3. In a 2012 interview withIsthmusHeggie said that DeMain understands his work innately because they both have backgrounds in American musical theater. DeMain, he added, is “one of the top conductors in the world.” EARTHfeatures the Madison Symphony Chorus, Mt. Zion Gospel Choir, and the Madison Youth Choirs. “We wanted to write something for our arts partners in Madison who we have worked with,” says DeMain. It also stars Met Opera soprano Ailyn Pérez. DeMain says Gene Scheer’s libretto “recounts the evolutionary process of our extraordinary planet.” “I didn’t want Jake to write a piece that was centennial and Madison-specific because then it would be played one time and never played again,” says DeMain. “I wanted Jake to write a piece that had legs and that other orchestras may want to perform in the future.” DeMain will conduct his final concert as the MSO’s music director during a weekend of free centennial events at the Overture Center on June 13-14. “There will be rock groups, world music groups, and jazz as well as chamber music,” he says. Peter Rodgers Greg Zelek creates opportunities for the organ. MSO’S OVERTURE CONCERT ORGAN Greg Zelek, the MSO’s principal organist, has built a sizable and avid audience for the Overture concert organ. “I want to introduce different audiences to the organ, new people who would otherwise not come,” he says. Thisseasonhighlights the organ’s versatility: ideal for classical and sacred music, but also for jazz and folk songs. The organ series has four concerts that run Oct. 2 to March 31, 2026. All performances are in Overture Hall. The first concert features Zelek and the UW-Madison Concert Choir under the direction of Mariana Farah. The repertoire ranges from sacred music to Brazilian folk songs. Instrumentalists from the School of Music will also make an appearance in Eriks Esenvalds’Trinity Te Deum. On Nov. 18, Zelek and trumpeter Caleb Hudson, Zelek’s former colleague at the Juilliard School, play a mix of Bach and jazz. Also included are Bartok’sRomanian Folk Dances, exotic little tunes that look deceptively easy to play. Organist Felix Hell returns on Feb. 24, 2026, with his own arrangement of Beethoven’s Fifth Symphony. Zelek says the audience will hear the Fifth in a new and exciting way. The final concert on March 31 features Zelek and nine of his MSO colleagues in celebration of the centennial. Works of Handel, Mozart, Bach and Samuel Coleridge-Taylor bring another organ season to a rousing finale. WISCONSIN CHAMBER ORCHESTRA TheWisconsin Chamber Orchestracontinues its exploration into the innovative works of composers of color in a concert titledEndeavoron Oct. 10 in the Overture Center’s Capitol Theater. This is the third installment of itsMusical Landscapes in Colorproject. “We have a multi-generational approach to this year’s lineup,” says music director Andrew Sewell. “Autumn Maria Reed and Xavier Foley represent the younger composers, while older composers include Regina Harris Baiocchi, Eric Gould, and Omar Thomas, who are in mid-career.” This concert will be recorded live for a 2026 album release. The WCO’s Masterworks series consists of five concerts, all in the Capitol Theater. Masterworks I on Nov. 14 features Finnish composer Rautavaara’sSuite for Stringsfrom 1952. The Suite’s layered textures are reminiscent of Bach, but its wispy veils of sound place it in modern times. Then Vladyslava Luchenko plays Mendelssohn’s Violin Concerto in E Minor. Masterworks II on Jan. 30, 2026, features Ilya Yakushev in Prokofiev’s Piano Concerto No. 3. Yakushev’s style is fresh and energetic, just right for the concerto’s fast pace and unpredictable twists and turns. Masterwork III on Feb. 27 features the world premiere of Dan Cavanagh’s Concerto for Jazz Trio. Cavanagh is the director of the Mead Witter School of Music at the UW-Madison. Concluding this concert, the WCO presentsRegeneration: A Pentalogy, a symphony by local composer Michael Bell. Kanopy Dance joins the WCO in the company’s world premiere ofRenascence, choreographed to Bell’s music. This will be the first timeRenascenceis performed in its entirety with an orchestra. Masterworks IV and V are vastly different. For IV, violinists Eric Silberger and Gilles Apap return on March 27 as dueling violinists. Masterworks V on April 17 features pianist Salome Jordania. Sewell says Jordania is a Georgian pianist based in both the U.S. and London making her Madison debut playing Saint Saens’ Piano Concerto No. 2. MADISON OPERA Courtesy Madison Opera Madison Opera tackles ‘La Bohème’ with Terrence Chin-Loy, left, and Renée Richardson. La Bohèmeopens theMadison Opera’s seasonon Nov. 7 and 9 in Overture Hall. “At its core,La Bohèmeis about a group of young people dealing with the realities of friendship, love, financial hardship, illness, and ultimately death,” says Kathryn Smith, general director of the Madison Opera. “In real life, everyone deals with at least some of these issues, and Puccini set it all beautifully to music.” After its world premiere in Turin in 1896,La Bohèmepremiered in the United Kingdom in 1897, the same year that a murder happened across the Atlantic in Greenbrier County, West Virginia. Trout Shue killed his wife. But the doctor classified her death as an “everlasting faint,” a 19th century phrase used when a woman’s cause of death is unknown. Her ghost returns to tell her mother that Trout killed her. This true crime story is the subject of the next opera,Everlasting Faint, on Feb. 13 and 15 in the Overture Center’s Capitol Theater. Madison-based composer Scott Gendel and librettist Sandra Flores-Strand weave together an intriguing contemporary opera about a mother’s efforts to find justice for her daughter. After Puccini’s gritty realism and Gendel’s ghost story, the season ends in Overture Hall on April 24 and 26 with Mozart’s well loved romantic comedy,Cosỉ fan tutte. Welcome to the salon Alex Fedorov Angie Zhang. The seasons for the MSO, WCO and the Madison Opera take place in large venues that seat hundreds, even thousands. Farley’s House of Pianos in Madison is a go-to for theSalon Piano Seriesof intimate piano concerts. This season’s six concerts feature international artists, award winners, and returning favorites. Opening the series on Oct. 4 is Polish pianist Tomasz Lis with works by Brahms and Chopin and the Baroque masters Bach and Scarlatti. On April 18, 2026, American pianist Angie Zhang plays the contemporary music of Philip Glass and Caroline Shaw. The final concerts on May 9-10 features Grammy Award-winning jazz pianist Bill Charlap known for his wide-ranging styles from stride piano to bebop to modern jazz. The pianists also hold masterclasses that the public is invited to observe for free. bySandy Tabachnick September 4, 2025 8:00 AM", "date": "2025-09-04", "author": "bySandy Tabachnick", "section": "music", "location": "downtown", "source": "isthmus"}
{"url": "https://isthmus.com/arts/what-to-do-in-madison-this-weekend-feb-19-22-2026/", "title": "What to do in Madison this weekend: Feb. 19-22, 2026", "text": "Wristwatch album release, Melissa Faliveno and more Isthmus Picks byIsthmus Staff Arts February 19, 2026 5:03 AM James Pederson Wristwatch celebrates the release of 'III' Feb. 21 at the Crystal Corner Bar. courtesy The Porch Flowers The Porch Flowers Julia Houck Scott Stanley, Josh Gibbons and Colleen Murphy, from left, in 'C'est La Vie,' Madison Public Theatre, 2026. Julia Matthew Photography Whoopensocker Kathy Clancy Model Railroad School Sue Gitchel The Dawg Bones (left to right): Carl Gitchel, Todd Thompson, Steve Oasen. Shervin Lainez Vienna Teng Find the individual Pickscollected here, and as part of the fullcalendar of events. Editor's note: This post has been updated to correct an error in the Fire and Wonder pick (San Damiano is on Lake Monona, not Mendota). byIsthmus Staff February 19, 2026 5:03 AM", "date": "2026-02-19", "author": "byIsthmus Staff", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/isthmus-madison-picks-feb-16-to-19-2026/", "title": "What to do in Madison this week: Feb. 16-19, 2026", "text": "Shaun Cassidy, Ethelene Whitmire and more Isthmus Picks byIsthmus Staff Arts February 16, 2026 5:03 AM Hope Kelham Ethelene Whitmire will discuss the new book 'The Remarkable Life of Reed Peggram' on Feb. 18 at Central Library. John Roach Projects Howard Moore in the film 'A Road at Night.' courtesy Johnny Chimes Johnny Chimes Linda Falkenstein. Orchid Escape is an annual Bolz Conservatory exhibit at Olbrich Gardens. courtesy Marionette Management Stephen Kellogg and the Homecoming courtesy Jill Fritzo Public Relations Shaun Cassidy Anna M. Maynard Melissa Faliveno John Russo Chelsea Handler Find the individual Pickscollected here, and as part of the fullcalendar of events. byIsthmus Staff February 16, 2026 5:03 AM", "date": "2026-02-16", "author": "byIsthmus Staff", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/stage/madison-ballet-pointes-of-view-vibrant-and-accessible/", "title": "Madison Ballet’s ‘Pointes of View’ is vibrant and accessible", "text": "Under Ja’ Malik’s guidance, the company’s deep bench of talented dancers is doing excellent work byKatie Reiser Stage February 14, 2026 10:50 AM Matthew Ulrich ‘Variations on a Grosso’ features dancer Eric Stith III. \"Pointes of View\" is the perfect entry point for potentially reluctant audience members. I have to confess that I haven’t seen Madison Ballet since Ja’ Malik became the company’s artistic executive director and I’m glad to report that under his capable and creative guidance, the company’s deep bench of talented dancers is doing excellent work. It’s clear that across the board the dancers are well trained and well rehearsed. The program opens with the Madison premiere ofSchubert Waltzesfrom choreographer Heinz Poll. While it is the most traditional ballet on the program, Poll still surprises with innovative lifts and fun touches like bourrées in parallel for the women. Three couples charm us throughout, playing with musical phrasing and all six genuinely connecting with each other on stage. I was pleased to see that the always outstanding Shannon Quirk is still with the company. She is paired with Benjamin Shepard, an attentive and considerate partner (especially when he tackles lifts right after a demanding solo). Tom Mattingly’sFlightwas another Madison premiere, set to music by Oliver Davis and featuring truly lovely costumes in muted tones by designer Sarah Dornink. Charlotte Junge, a former apprentice and now a company dancer, is a breakout star. You’re drawn to her because she combines top-notch technique with a confident, commanding stage presence. Her pas de deux with the gifted Ben Rose in the second movement was a particular delight. Mattingly has a knack for creating striking formations and keeping things fresh with quicksilver directional changes.Flightis a deeply pleasant experience. Ja’ Malik’sVariations on a Grosso, set to Antonio Correlli’s lively score, has been expanded and re-worked. Julie Ballard’s innovative lighting design initially elicited a gasp from the audience and was compelling for the duration. The sextet of dancers was uniformly excellent. Michaela King shines, her supple and expressive back showcased in her glittering purple costume. Eric Stith, a strong turner and jumper, was the consummate professional, not letting a glitch with the recorded music interrupt his solo. Junge and Dana Sheldon were well matched and seemed to genuinely connect through the choreography. The work is punctuated by swiveling hips, rolling shoulders, and surprising floorwork which kept me guessing, but ultimately the simple final moments resonated the most with me. The dancers bow to one another from opposite sides of the stage in reverence and, as they exit, turn their heads to catch a last fleeting glimpse of each other. Agape’, from Ja’ Malik, is a pas de deux for two male dancers that soulfully conveys yearning. It opens (and closes) with a lift so striking I wasn’t even sure what I was seeing, the dancers’ bodies entangled in an innovative shape. James Wainwright and Antony Zambrano Reyes danced with both vulnerability and strength. It felt as though their souls were laid bare, their chests exposed above flowing chiffon skirts from Fernanda Yamaguchi (also a company dancer). The charming crowd-pleaserWeibermachtclosed the program. Choreographer Richard Walters (company rehearsal director and school principal) uses Mozart’s music in wise and witty ways. The all-female cast is initially clad in blue and white dresses, but Sarah Martin, a talented comedic actress, is the first to don a long black vest and clunky black boots, and soon the entire cast follows her fashion lead. Clomping boots juxtaposed with elegance and grace had the crowd on its feet during a particularly spirited curtain call. Walters’ work is amusing without being cutesy and genuinely made me smile when Martin cavorted with Sheldon to Papagano and Papagena’s duet fromThe Magic Flute. Promenade Hall is an intimate performance space: You can see the dancers’ perspiration and hear their breathing, creating a personal connection between the audience and performers. Ballet can intimidate people. Audiences often include die-hard balletomanes (often including ballet students and their dedicated parents) alongside people who may have only seenThe Nutcrackerand feel that they don’t know enough about the art form to fully appreciate it. \"Pointes of View\" offers something for everyone. Regular balletgoers will find wonderful technique in challenging works, while newcomers can simply be swept up in the music, costumes, choreographic creativity, and the dancers’ ability to convey sincere emotion. Luckily, you have three more opportunities to see this excellent production; matinees at 2 p.m. Saturday and Sunday and a Saturday evening performance at 7 p.m. [Editor's note: This post has been updated to correct the spelling of the names of Michaela King and Fernanda Yamaguchi.] byKatie Reiser February 14, 2026 10:50 AM", "date": "2026-02-14", "author": "byKatie Reiser", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/isthmus-madison-picks-feb-12-to-15-2026/", "title": "What to do in Madison this weekend: Feb. 12-15, 2026", "text": "Garden and Green Living Expo, 'Everlasting Faint' and more Isthmus Picks byIsthmus Staff Arts February 12, 2026 5:03 AM Ross Zentner Katherine Pracht, left, and Tori Tedeschi Adams in Madison Opera’s 'Everlasting Faint;' performances are Feb. 13 and 15 at Overture Center. photo by Mariah Monedah/courtesy MMoCA 'all this and not ordinary' is an exhibition of works by Sabina Ott. Julia Houck Scott Stanley, Josh Gibbons and Colleen Murphy, from left, in 'C'est La Vie,' Madison Public Theatre, 2026. provided by Joyce DiDonato and Time for Three Joyce DiDonato, right, and members of Time for Three. Andy Ewen A drawing by Andy Ewen. Tom Davenport Madison Ballet dancers Alex Vrba, left, and Lauren Thompson. Kell Lorenz Bad Bad Hats Bob Koch Gentle Brontosaurus soggyprairie.com Soggy Prairie courtesy Hush Now, Sweet Halo Hush Now, Sweet Halo Find the individual Pickscollected here, and as part of the fullcalendar of events. byIsthmus Staff February 12, 2026 5:03 AM", "date": "2026-02-12", "author": "byIsthmus Staff", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/isthmus-madison-picks-feb-9-to-12-2026/", "title": "What to do in Madison this week: George Saunders, 'A Valentine's Affair' and more Isthmus Picks", "text": "byIsthmus Staff Arts February 9, 2026 5:06 AM Mike Palskill Nate Chappell Several Questions with Nate Chappell,Monday, Feb. 9, Gamma Ray, 6:30 p.m.:ComedianNate Chappellhas been hosting theSeveral Questionspodcast weekly for several years now, and the podcast has also morphed into the occasional live event in local clubs. The latest edition, “Oops, All Autistics,” features a panel of four autistic individuals — Riley Kowalksi, Shivam Patel, John Roth and Laura Sweeney — fielding questions from Chappell. The evening starts with music by Ty Ensrude. Tickets benefit the Autism Society of South Central Wisconsin, and can be found atgammaray.bar. Faisal Abdu’Allah,through Feb. 20, BioPharmaceutical Technology Center Gallery, Fitchburg:UW-Madison professor Faisal Abdu’Allah creates art in a variety of media — printmaking, photography, barbering — but no matter the form it is always thought-provoking. His collection for the Promega Art Showcase, “Family Ties,” explores the connections of ancestry and chosen groups; as described by the gallery, “the artist explores the passage of time, unpacked masculinity, mythology and racial perception.” Regular gallery hours are 8 a.m.-4 p.m. Monday-Friday. Find more info atpromega-artshow.com. Pat Martin George Saunders George Saunders,Tuesday, Feb. 10, Orpheum, 7 p.m.:What a coup for theWisconsin Book Festivalto be hosting George Saunders on his tour for his new novel,Vigil. His first novel,Lincoln in the Bardo, broke pretty much all the molds and won the prestigious Man Booker prize.Vigilclaims similarly offbeat territory, as a figure (we won’t say angel) comes back to Earth to escort a dying man to the afterworld. Like so much of Saunders' work, it tackles the big questions in most unexpected ways. Free copies of the book will also be handed out at this free event; expect a line and a packed house. Doors open at 6 p.m. Patrick Gray Emily Koch. ;eft. and Laura Woyasz in the touring production of 'Kimberly Akimbo.' Kimberly Akimbo,Feb. 10-15, Overture Hall:Some musicals dare you to feel something.Kimberly Akimboambushes you — then hands you a punchline so you don’t get too comfortable. The musical adaptation ofDavid Lindsay Abaire’s playabout a teenager suffering from a disease causing advanced aging swept the 2023 Tonys with five wins, including Best Musical, and you can hear why: it’s brisk, sharp, and oddly life-affirming, with humor that doesn’t sand down the sharp edges. Performances at 7:30 p.m. Feb. 10-13, 2 and 7:30 p.m. on Feb. 14, and 1 and 6:30 p.m. Feb. 15; tickets atoverture.org. Andy Ewen,Feb. 11-March 21, Giant Jones Brewing; reception Feb. 20, 5-9 p.m.:In the 1980s and '90s Andy Ewen created illustrations forThe New York Times Book Review,The ProgressiveandIsthmus; more recently his professional life has been at the UW-Madison medical school. But many in Madison will know Ewen as frontman/songwriter for the band Honor Among Thieves. In an artist statement, Ewen describes the work in “Recent Drawings” as “semi-automatic…I just start by drawing a line or a shape, and then let my imagination free associate in a manner akin to lucid dreaming.” The tasting room at Giant Jones is open Wednesday-Saturday; find hours atgiantjones.com. A reception takes place from 5-9 p.m. on Feb. 20. Ironbound,through Feb. 15, Overture Center-Playhouse:Forward Theater Company presents the Wisconsin premiere of a play centered on a timely topic: the experience of an immigrant in America.Ironbound, by Martyna Majok, tells the story of a couple decades in the life of a woman from Eastern Europe who lands on the East Coast in the late 20th and early 21st century looking for a better life, and love, in a new country. How will her life plans change over the years while fighting for a secure existence? Read Rebecca Jamieson's reviewhere. Performances at 7:30 p.m. Wednesday-Saturday and 2 p.m. Sunday, plus 2 p.m. on Feb. 7 and 14. Tickets atoverture.org. John Roach Projects A photo of Howard Moore and family from the film 'A Road at Night.' A Road at Night,Thursday, Feb. 12, Point Cinema, 5:30 p.m.: A Road at Nightis a documentary about former Wisconsin Badgers basketball player and coach Howard Moore and his family. Before the film screened at the 2025 Wisconsin Film Festival, director John RoachtoldIsthmuseditor Judith Davidoff that it’s a film not about basketball, but a cautionary story about drunk driving; Moore’s wife, Jennifer, and daughter, Jaidyn, were killed, and Moore and his son, Jerrell, seriously injured in crash caused by a drunk driver. The film’s first run in a theater begins with abenefit eventon Feb. 12, featuring a panel discussion and reception along with a screening; all proceeds from screenings (continuingthrough Feb. 18) will support Howard Moore’songoing medical care. Social Cinema,Thursdays, Feb. 12-March 19, UW Union South-Marquee, 6:30 p.m.:Each winter, the Havens Wright Center for Social Justice (with other campus partners) coordinates the Social Cinema film series. This year features documentaries on timely topics: book bans (The Librarians, Feb. 19); the housing crisis (Fault Lines, March 5); families facing state bans on transgender care for their children (Just Kids, March 12); and the right’s attempt to create a narrative of white victimization (White With Fear, March 19). The series kicks off farther afield on Feb. 12 withMr. Nobody Against Putin, the story of a Russian school worker who quietly documented the rise of militarization in schools following Russia’s invasion of Ukraine. Find more info and the full schedule athavenswrightcenter.wisc.edu. A Love Letter,through Feb. 15, Art House 360, Verona:Theatre LILA collaborates with the contemporary and hip-hop-inflected Madison dance company Barrio Dance for an experimental dance-theater production. It’s about love — but, like love itself, it takes unexpected turns and leads the audience into new places. Theatre LILA’s Jessica Lanius callsA Love Letter“immersive” and says that the new venue ART House 360, 401 W. Main Street in Verona, enhances that connection. Shows are at 7 p.m. Thursday-Friday, 2 and 7 p.m. Saturday, and 2 p.m. Sunday; tickets attheatrelila.com. Chris Singer Joyce DiDonato Joyce DiDonato + Time for Three,Thursday, Feb. 12, UW Memorial Union-Shannon Hall, 7:30 p.m.:Emily Dickinson was no church mouse — her poetry frequently encompasses big feelings, as doesEmily: No Prisoner Be. The setup alone is a jolt: superstar mezzo Joyce DiDonato joins the genre-hopping trio Time for Three for a made-to-measure piece by composer Kevin Puts (who wrote the music for the 2022 operaThe Hours). Video projections and Dickinson’s poems drive the whole thing like a theatrical pulse. Think less “song cycle” and more interior drama — 24 poems, big emotion, and an evening that treats Dickinson as the complicated artist she was. Tickets atartsticketing.wisc.edu. C’est La Vie,through Feb. 21, Bartell Theatre:Though this production is new, the concept is familiar: a lifetime includes a lot of scenes you don’t realize mattered until later.C’est La Vie, presented by Madison Public Theatre, features a collection of short works, written by Gretchen Suárez-Peña, that examine “the little things that make us all human,” as described by theplaywright. Performances at 7:30 p.m. Thursday-Saturday (except 1:30 p.m. on Feb. 21) and 1:30 p.m. Sunday. Tickets atbartelltheatre.org. Emanuel Noel Photography Reesa Karamanski, Jason Compton and Shelton Tripp, prone, in 'A Valentine's Affair,' Madison Shakespeare Company, 2026. A Valentine’s Affair,Feb. 12-14, Bartell Theatre:Love can be messy. Madison Shakespeare Company’s flirtatious annual compilation, “A Valentine’s Affair,” leans into the mess with works drawn from canonical writers such as William Congreve, Thomas Heywood, Edmond Rostand and, of course, Shakespeare. The best part is often the curveball: “Sonnets From a Hat,” where the audience helps pick a random sonnet to be performed. It’s a fast-moving, slightly feral mash-up of love in all its forms. Performances at 7:30 p.m. Feb. 12-13 and 5 p.m. Feb. 14; tickets atbartelltheatre.org. Find the individual Pickscollected here, and as part of the fullcalendar of events. Editor's note: This post has been updated with a new ending date for screenings ofA Road at Night. byIsthmus Staff February 9, 2026 5:06 AM", "date": "2026-02-09", "author": "byIsthmus Staff", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/arts/books/madison-novelist-susanna-daniel-girlfriending/", "title": "Madison novelist Susanna Daniel chronicles a journey through 10 dates in ‘Girlfriending’", "text": "A new fiction direction for changing times byLinda Falkenstein Books February 8, 2026 1:00 PM Romulo Ueda It’s been a long time coming: ‘Girlfriending,’ Daniel’s first novel in 13 years, marks a new direction for her fiction. It’s been a while since we’ve seen a novel from Madison writer Susanna Daniel. Daniel, who runs the Madison Writers’ Studio with novelist Michelle Wildgen, published her last novel,Sea Creatures,in 2013. It wasn’t a fallow period. BetweenSea Creaturesand her new novel,Girlfriending, which publishes on Feb. 10, Daniels wrote another novel that she was on the verge of selling in March 2020. Things stalled because of the pandemic, but ultimately, Daniel says, it was the murder of George Floyd that made her decide not to publish it. “The world changed so much,” she says.“It doesn’t really matter if it was a good book or not. It wasn’t me anymore and it wasn’t what I wanted to put out in the world anymore.” The newGirlfriendingis autofiction, a genre that — like all fiction — blends truth with invention, but leans more heavily into real events. The narrator ofGirlfriendingis, like Daniel, an editor and writer who teaches writing classes. Like Daniel, her last name is Daniel (the narrator has no first name). Girlfriending’s narrator, newly divorced from her husband, begins dating women and experiences two breakups in fairly short order. She vows to find 10 more women to date, as part of what the character terms her “lesbian adolescence.” “I was writing while I was heartbroken — all of it was very much happening in real time,” Daniel says. She would come home from a date and start taking notes. “I was almost trying to watch myself from a distance so that I could find some kind of story to tell myself about this massive hole I had fallen into.” Daniel wanted to consider what the writer is giving the reader. “What are you offering? A memoir or a story from life is, above everything, an offering to the reader. And I felt I had something to offer.” What emerges is not just a quest for love and reconciliation, but for community. Daniel teamed with woman-centered publisher Third Rail Press, dedicated to women’s stories that mainstream publishers deem too difficult or unmarketable — here, realistic depictions of sex and what Daniel calls “unconventional family arrangements that are not unhappy.” She was relieved the editors were on board: \"I'm happy, really happy.\" Daniel will discussGirlfriendingwith Minneapolis-based novelist (and Daniel’s longtime friend) author Curtis Sittenfeld at 7 p.m. on Feb. 12 at the Central Library as part of the Wisconsin Book Festival. byLinda Falkenstein February 8, 2026 1:00 PM", "date": "2026-02-08", "author": "byLinda Falkenstein", "section": "arts", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/events/monkey-business-institute-saturdays/?occ_dtstart=2026-02-21T17:30", "title": "Monkey Business Institute", "text": "Feb 21, 2026 5:30 PMto8:00 PM Glass Nickel Pizza - Atwood Ave.2916 Atwood Ave.,Madison,Wisconsin53704 February 7, 2023 2:07 PM media release: All-Ages Show: This one-hour show is packed with fast-paced, classic, short-form improv comedy! Audience participation is guaranteed and the content is appropriate for kids, as well as grown-ups who appreciate smart, clean comedy. Show starts at 5:30pm, doors open at 4:45pm. $12. Grown-Up Show: Our Grown-Up Show features two acts of hilarious improv comedy. This show is for people who like their improv a little bit saucy, so content is usually rated PG-13 with an occasional dip above “PG-17.” Show starts at 8:00pm, doors open at 7:15pm. $18. Online ticket reservations strongly recommended. One drink minimum. At Glass Nickel Pizza Company, 2916 Atwood Avenue, Basement Stage February 7, 2023 2:07 PM", "date": "2026-02-21", "author": "", "section": "arts", "location": "atwood", "source": "isthmus"}
{"url": "https://isthmus.com/news/news/madison-hemp-stores-face-evolving-federal-state-and-local-regs/", "title": "Madison hemp stores face evolving regulations", "text": "Many of the hemp-derived THC products they sell could be banned by late 2026 byNoe Goldhaber News February 17, 2026 9:00 AM Tommy Washbush Businesses selling hemp-derived products line State Street, making up a visible part of Madison’s retail economy. But many owners are now staring down major federal changes that could make the products they sell illegal by November 2026 unless Congress acts. “We're not planning on much of a future, unfortunately,” Matt Nelson, co-founder of Herbal Aspect, tellsIsthmus. “We've been building this business for five years. You know, it's a seven-figure business...and now for no good reason, it's all being undone.” Nelson — who owns five businesses across the Madison region — says the worst part is the potential laying off of his 22 employees. “In an ideal situation, we can keep a store open with whatever regulated products we can sell, keep some core members of our team,” Nelson says. “They love the company, so they all kind of want to stick it out to the end. You know, we'll give them as much heads up as we can.” Aloopholein the 2018 Farm Bill effectively legalized hemp-derived THC products by defining hemp based on delta-9 THC concentration, allowing other intoxicating cannabinoids to proliferate like delta-8. In 2025, Congress passed legislation thatnarrowed the legal definitionof hemp, effectively banning most hemp-derived THC products on shelves by late 2026. While many states responded to the 2018 legislation by developing regulatory frameworks or legalizing marijuana outright, Wisconsin remains one of justsix states withouthemp regulations beyond those in the 2018 Farm Bill. Local officials, however, have moved ahead. Citing concerns over youth access and accidental ingestion, the Madison city councilapprovedage restrictions, signage requirements and penalties for noncompliant hemp businesses in November. City council President Regina Vidaver, who sponsored the legislation, says the city’s approach is focused on harm reduction and consumer protection. “There’s zero regulation right now, and so [we’re] trying to put that regulatory framework on them so that people can know what they're consuming in exactly the same way they know what they're consuming when they're consuming alcohol,” says Vidaver. Tony Herman, owner of Dank of America, a Madison business with two locations, says the industry generally welcomes reasonable regulations. “Regulation has been a big topic in the industry for quite some time,” Herman says. “It’s severely unregulated, so to have some regulation is extremely welcome — with the hope that it doesn’t become overregulated and turn into a problem.” The city policy mirrors abipartisan state proposalco-authored by Sen. Patrick Testin, R-Stevens Point, and Rep. Tony Kurtz, R-Wonewoc, which would establish a 21-and-over age restriction, truth-in-labeling requirements, independent testing standards and potency limits for hemp-derived beverages. Testin says the legislation was developed with input from the hemp industry to create “common-sense regulations.” Testin describes Wisconsin’s hemp industry as the “Wild Wild West.” “There are no age requirements, no restrictions whatsoever,” Testin says. “That has certainly caused a lot of angst and heartburn, not just within the industry, but for a lot of consumers out there.” Public health data underscores those concerns. Between September 2023 and August 2025,Dane County recorded 167THC-related EMS calls involving people under 21, including four calls in recent months for children under 10, according to statistics released by Public Health Madison and Dane County in September. Unlike marijuana, hemp-derived THC products can be sold at gas stations and grocery stores, including locations near schools. Without clear labeling, officials say accidental ingestion is an increasing concern. “A lot of the products are marketed in a way that looks like candy or the drinks just appear to be seltzers,” Vidaver says. “It can be difficult for even a parent to know if their kid is ingesting something intoxicating.” While some local businesses, including Herbal Aspect and Dank of America, voluntarily check IDs and test their products in the absence of statewide regulation, both officials and business owners say inconsistent enforcement remains a problem. “We've tried to operate in the way we want the laws to be written so everybody is carded,” Nelson says. “We actually have pretty strict protocols for even moving product in between stores.” In 2024, Public Health Madison and Dane County surveyed 68 retailers selling hemp-derived products. While 71% of stores reported having a 21-and-over policy, department staff were asked for ID in just four of 13 stores where they purchased a product or received a free sample, according to thesurvey. Dank of America’s Herman also emphasizes the importance of independent testing. While his company ensures its products meet medical marijuana quality standards, he says that without formal regulations, there is little to prevent contamination from heavy metals or mold. “You have to test for mold, E. coli and heavy metals,” Herman says. “That should be a minimum standard when you’re selling a product to another human being.” Vidaver says the city’s legislation will also license hemp businesses similarly to alcohol retailers, with public health officials working to transition the Alcohol License Review Committee into an Intoxicating Substances Review Committee. “If you look at State Street, the density of THC shops is very high,” Vidaver says. “When visitors come to the city and walk down our main downtown shopping street, and every other shop is a THC shop, it’s not a good look.” Nelson says that while most of the city council’s regulations align with practices Herbal Aspect already follows, one provision poses a significant problem: prohibiting new businesses from selling hemp-derived products within a quarter-mile of schools or parks. “Effectively, that rule means no one can open a new hemp store,” Nelson says. “There’s almost nowhere in this town that’s more than a quarter-mile from a park or a school.” Testin and Kurtz’s bill is one of several bills state legislators are weighingto address hemp and marijuana in Wisconsin. Another bipartisan bill introduced by Sen. Eric Wimberger, R-Oconto, creates a three-tier system for hemp modeled after the alcohol industry, separating manufacturers, distributors and retailers and grandfathering in current alcohol-license holders. Intestimonyto the Assembly Committee on State Affairs in November, hemp industry advocates accused Wisconsin’s powerful alcohol lobby, the Tavern League, of pushing for the legislation. Herman also criticized the bill. Tommy Washbush Nelson at Herbal Aspect on Winnebago Street: 'We're not planning on much of a future, unfortunately.' “I think beverage companies are losing millions to the cannabis industry,” Herman says. “This [regulation push] is happening fast because some very powerful people are losing a lot of money.” Another Republican-ledbillwould effectively ban hemp in Wisconsin. Testin says his and Kurtz’s bill fits the “Goldilocks” approach. “We've got three bowls of porridge. One is a little bit too cold — that's the bill that would outright ban these products. You got one that's a little too hot, where you have them thrown all into the three-tier system, like alcohol. And then I think ours finds the right balance and the right approach,” Testin says. Testin says it was “truly clear as mud” whether the passing of his bill could protect Wisconsin’s hemp industry in the face of the federal loophole closure. “I'm hopeful and optimistic that Congress will undo what they did, but in the event that they don't, we still need to make sure that we have some regulatory framework at the state level because whether individuals like these products or not the horse is out of the barn and you can't put the genie back in the bottle and these are widely popular for individuals that utilize them,” Testin says. Testin also says the looming federal changes could create a larger vacuum for black market products in Wisconsin. For business owners like Nelson and Herman, the uncertainty has upended long-term planning. Herman said Dank of America also operates as an event space, lounge and gallery, giving the business alternative revenue streams if hemp products are no longer legal. “We’re not just a cannabis dispensary,” Herman says. “We’re a cultural gathering spot — a lounge, an event space, an art gallery. It’s not all about cannabis sales.” Testin is optimistic that lawmakers could advance the bill before the session ends Feb. 19, saying they are considering amendments to build a broader consensus: “My hope is that we get something done in the next couple of weeks before the session wraps up and everyone heads back to their districts for another wild ride in Wisconsin politics.” byNoe Goldhaber February 17, 2026 9:00 AM", "date": "2026-02-17", "author": "byNoe Goldhaber", "section": "news", "location": "state street", "source": "isthmus"}
{"url": "https://isthmus.com/news/news/madison-mayor-paying-damages-for-uncounted-votes-sets-a-dangerous-precedent/", "title": "Madison mayor: paying damages for uncounted votes sets a dangerous precedent", "text": "Petitioners represented by firm Law Forward seeking $34 million in damages byLiam Beran News February 11, 2026 10:10 AM Liam Beran The city of Madison failed to count 193 ballots in the November 2024 election. Faced with calls to disavow Madison’s novel legal argument that absentee votes do not enjoy a constitutional right to be counted, Madison Mayor Satya-Rhodes Conway has a different suggestion: state legislators should change a 1985 law referring to absentee voting as a “privilege.” “When a lawyer quotes the law, they're not saying they believe it,” Rhodes-Conway says in an interview on Feb. 6. “They're just saying that's what the law says.” She adds: “If we have a problem with that statement in law, in state law that is on the books, then we should be going to the Legislature and saying, ‘Change that state law.’ For the record, I do have a problem with it. I do think the Legislature should change that.” In November 2024, the city of Madisonfailed to count193 absentee ballots, even though the then-City Clerk Maribeth Witzel-Behl was made aware of the error in time for it to be at least partially reversed. The uncounted votes did not affect the outcome of any races. The Wisconsin Elections Commission launched an investigation into the mistake, which ultimately found that Witzel-Behl violated five elections laws, andplacedseveral orders upon the city in August to ensure such a mistake does not occur again. And, in September, progressive law firm Law Forward filed a class action suit on behalf of eight plaintiffs. The firm is seeking $175,000 in damages for each voter disenfranchised. “The question really in this lawsuit is, when human error happens in a clerk's office, should that office have to pay up to millions of dollars?” says Rhodes-Conway, who adds that the city's longstanding support of absentee voting has \"not changed.\" A judge has ruled that the city can be held liable for monetary damages. On Feb. 9, Dane County Circuit Court Judge David Conway declined to dismiss the case and ruled that the voters may seek monetary damages. “The court concludes that Wisconsin law recognizes a cause of action for damages against election officials who negligently deprive citizens of the right to vote,” wrote Conway. The judge also ruled that “just because the absentee voting process is a privilege does not mean that those who legally utilize it do not exercise their constitutional right to vote.” In a Feb. 11Milwaukee Journal Sentinelop-ed, Rhodes-Conway wrote that the city supports Conway's ruling regarding whether absentee votes are constitutionally protected and does not plan to contest it. The city’s argument has been met with near-universal backlash. Both Gov. Tony Evers and the Wisconsin Elections Commission submitted amicus briefs in opposition. Howard Schweber, a UW-Madison professor emeritus who studies constitutional law, says the city’s argument for dismissing the case was “extraordinarily weak.” Though Wisconsin’s constitution does not explicitly require absentee voting, it does mandate that legally cast votes be counted. “Once absentee ballots are part of the [statutory voting] system, if the legal requirements are satisfied, there's a constitutional right to have those votes counted on the same basis as others,” says Schweber. The question of damages, Schweber says, is where “the question gets much more interesting.” Until Monday’s decision, Wisconsin courts had not yet taken up the question of whether plaintiffs may seek damages for disenfranchisement, let alone that done negligently, Schweber says. Law Forward’s choice to seek remuneration, in his view, is meant to deter other municipalities from making similar mistakes in the future. “The lawyers and the parties who are promoting this lawsuit want to see damages awarded because they're concerned that there needs to be some kind of serious incentive to compel districts to count absentee ballots,” says Schweber. “The context of this is, of course, the coming 2026 midterms and the controversies we've had over the last three election cycles over absentee ballots.” Precious Ayodabo, the lead plaintiff in the suit, made a similarargumentin a Feb. 8 op-ed inThe Capital Times: “Frankly, it is not good enough that the city claims it’ll do better next time.” “No matter what the city says, I believe my vote is worth something,” Ayodabo wrote. “It’s worth enough that I waited for hours in line to cast it. It’s worth enough that politicians spend millions of dollars to receive it. It’s worth enough that people have put their lives on the line and died to protect it.” But Schweber says, exposing municipalities to financial liability for accidentally not counting ballots — not to mention increased liability insurance costs — may create an incentive for state legislators to “diminish the availability of absentee voting across the board.” “That could be a perverse incentive, an idea that was intended to help ensure that voting would be fair and easily available to backfire by imposing costs on the system unless they can certify perfect accuracy. And of course, no one can ever certify perfect accuracy,” says Schweber. Rhodes-Conway concurs that allowing punitive damages for human errors in voting could lead to unforeseen issues. “Clerks offices are chronically underfunded across the state, and if we have to pay millions of dollars out to lawyers, that's money that won't be invested back into those clerks offices,” says Rhodes-Conway. “That is a huge question and has huge negative implications for our state.” Liam Beran City clerk Lydia McComas, left, says 'Making sure people can trust the system has been one of my priorities.' The city of Madison did adopt, without challenge, a set ofordersdrafted forit by the Wisconsin Elections Commission. It also implemented some changes that went beyond what the commission ordered, restructured the clerk’s office, and revised training for poll workers. Lydia McComas, who has been city clerk since September, tellsIsthmusshe has “no concern about our ability to count absentee ballots going forward.” “Part of the issue with the ballots in 2024 is that it wasn't clear to some inspectors, chief inspectors and election inspectors, where to find the absentee ballots,” says McComas. “For this next election, ballots will only be delivered on election day, and they will be handed from city staff to the chief inspector on election morning. Ballots [we receive] throughout the day will be delivered to the chiefs.” McComas is the former voter engagement division manager for Hennepin County, Minnesota, and replaced Witzel-Behl. McComas spoke withIsthmusat the Hawthorne Library, where officials on Feb. 7 conducted a public test of election equipment for the upcoming Feb. 17 spring primary. Early absentee voting began on Feb. 3 and will continue until Feb. 15. This is the first election McComas is administering in Wisconsin. Having begun the job just four months ago, McComas says the error from November has been on her mind. “In elections, it's important to get it right no matter what. So I don't see that that's really weighing on me any different,” says McComas. “But I think the public trust aspect is, definitely.” Adds McComas: “I came from Minnesota, where everyone is very excited about voting, and that's the same in Wisconsin. People are really out there and have such high turnout in this state, which is wonderful. Making sure people can trust the system has been one of my priorities, and will continue to be one of my priorities.” [Editor's note: This articlehas been corrected to note that absentee voting concludes Feb. 15, not Feb. 17, and to remove a sentence that said the city could not contest Conway's decision.] byLiam Beran February 11, 2026 10:10 AM", "date": "2026-02-11", "author": "byLiam Beran", "section": "news", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/news/news/madison-school-board-sees-most-contested-races-since-2022/", "title": "Madison school board sees  most contested races since 2022", "text": "Incumbents Nicki Vander Meulen and Blair Mosner-Feltham face challengers byLiam Beran News February 5, 2026 11:00 AM Submitted photos Amy Robertson keeps a pretty close eye on the Madison school district. She is part of a group of parents who have raised concerns about the performance of Van Hise principal Rebecca Stein and she tries to keep up with school board meetings. She rates the board’s performance “fine, but not amazing,” but is a fan of seven-year board member Nicki Vander Meulen, whom she says “makes it a lot easier as a parent to understand what’s going on” by asking questions at board meetings and sharing information on social media. Nevertheless she is okay with the fact that both incumbents on the April 7 ballot — including Vander Meulen — have challengers. “Competition forces people to articulate what they stand for. Otherwise, it’s pretty hard to know what’s important to them.” One of Robertson’s concerns is with the school board’s lack of clarity over how the district is spending the funds raised through the November 2024 referendum — $100 million for operating funds and $507 million for capital projects. Combined, the referendums add $676 in annual property taxes on the average-value Madison home, estimated to be around $481,000. The capital funds are being used tosupportrenovations at 10 schools while the operating funds are for staff pay and benefits increases, and to support existing district services. The resulting property tax increases, says Robertson, are pushing her to the “max” of what she can afford: “Those [referendums] look a lot more real on a property tax bill than a ballot.” Attendees at a Jan. 13 candidate forum held by the Lapham Marquette Parent-Teacher Group raised other concerns about the board,includingwhether members ensure that parental complaints are brought to the attention of administrative officials. Parents also wanted to see action to improve student safety and address principal turnover at the district’s middle schools. Despite some discontent with the school board’s operations, there has been little interest in recent years in running for the board. In 2024 both candidates running for reelection were unopposed; in 2025 there was onlyone competitive race. The board’s president and vice president, Nichelle Nichols and Maia Pearson, have never faced a competitive race during their tenure on the board. Nichols has been on the board since 2022; Pearson has been on the board since 2021. This year, Dana Colussi-Lynde is running against Vander Meulen and Daniella Molle is taking on two-year member Blair Mosner-Feltham. The challengers say they’re representing constituencies not currently on the board. Molle, an immigrant, says she would serve as a voice for bilingual and multilingual students; Colussi-Lynde, who notes she is neither a teacher nor a parent of a student in the Madison district, says she would represent the average taxpayer. Says Colussi-Lynde: “Even if our politics aren’t necessarily super different, it’s always better to have more voices and more diverse backgrounds. That’s how you’re going to have more innovation, more broad coverage for the topics that you’re talking about, because you don’t ever want to be making those kinds of decisions in a silo.” Why hasn’t Madison seen moreschool board candidates in recent years? Michael Ford, an Oshkosh school board member and UW-Oshkosh professor who studies school board governance, says that the advantage enjoyed by incumbents might scare away newcomers. “If someone has name recognition, especially in these historically low turnout local elections, that matters a great deal,” says Ford. Ford also says that while the “primary role” of a school board is to better students’ academic outcomes, discontent with academic achievement is not a factor driving most school board races across the country. Hot-button social issues are, though it’s unlikely in deep-blue Madison that a group like Moms for Liberty, which has worked in recent years to get conservatives elected to school boards, would be that successful, adds Ford. Teacher unions also play a role, as endorsements and financial contributions can significantly boost a candidate’s viability and union members can both campaign door to door and raise money for candidates. “It certainly does matter a great deal from a financial aspect,” says Ford. In Madison, each school board candidate endorsed by the union has won her race since 2022. In 2025 Madison Teachers Inc. endorsed Martha Siravo, who ran against Bret Wagner, for an open school board seat. The union contributed $5,000 to her campaign — near the maximum $5,240 limit for political action committees — and Siravo won with 55% of the vote. Colussi-Lynde is a Madison Westgraduate with more than 25 years of experience in the IT industry. She says her top priorities are addressing classroom safety, creating a policy for student usage of artificial intelligence, and clarifying property tax spending. “It’s our job as a school board to ensure that our constituents and our community understand where that money is going and what it’s being used for, and that it’s being used responsibly,” says Colussi-Lynde. “Funding is really complicated…it’s our job to make sure that people do understand how this is done.” She says her background in technology will help her find efficiencies to reduce spending. At the Jan. 13 candidate forum she suggested that the district evaluate its software subscriptions to see what could potentially be trimmed. Molle, who immigrated to the United States from Bulgaria in 2003, has lived in Madison for 21 years. She currently works as a researcher at UW-Madison’s Wisconsin Center for Education Research, where she studies equity in public school leadership. Her scholarship, she says, piqued her interest in running for school board. “I gained an appreciation for the importance of school boards in supporting equity-focused work at the district level,” says Molle. One of her top priorities if elected to the board would be to strengthen staff support for the district’s bilingual education programs and services for multilingual students. Trump’s election, she says, also pushed her to seek office. Molle says that having contested races “increases the legitimacy of the school board” as a governing body. “I feel like democracy is falling apart at the federal level. It has been motivating to be engaged locally, because what use is democracy if you have an uncontested race?” byLiam Beran February 5, 2026 11:00 AM", "date": "2026-02-05", "author": "byLiam Beran", "section": "news", "location": "general madison", "source": "isthmus"}
{"url": "https://isthmus.com/news/news/high-stakes-in-madisons-uncounted-absentee-ballots-lawsuit/", "title": "High stakes in Madison’s uncounted absentee ballots lawsuit", "text": "At issue is whether municipalities should pay damages for a human-generated election error, says city attorney bySteven Walters News February 5, 2026 9:00 AM Tommy Washbush Election officials failed to count 193 absentee ballots cast in the 2024 presidential election. The outcome of alawsuitover Madison’s failure to count 193 absentee ballots in the 2024 presidential election looms over future elections. The impact could be significant: More voters are casting absentee ballots and Wisconsin’s statewide elections are often decided by very close margins. President Trump won Wisconsin last November by only 29,397 votes out of 3.3 million votes cast. A veteran member of the Wisconsin Elections Commission, Don Millis, says Madison’s legal response to the lawsuit filed over the uncounted ballots is similar to the November 2020 attempt by President Trump’s campaign to throw out more than 200,000 absentee ballots cast in Dane and Milwaukee counties. Wrong, says Madison City Attorney Michael Haas. “The city’s legal position bears no resemblance to the unserious effort to invalidate all absentee ballots that were lawfully cast and counted as part of the attempt to support the fake elector scheme and overturn the results of the valid 2020 election,” says Haas in an email statement. “Madison has a long history of supporting absentee voting and has been a leader in promoting and protecting that option and will continue to do so,” adds Haas, a former staff counsel to the Wisconsin Elections Commission. Haas says the lawsuit filed by some voters whose absentee ballots were not counted could set a dangerous precedent for all local governments whose clerks conduct elections. “The primary issue in the lawsuit is whether the state Constitution or state statutes allow voters to recover money from a municipality when their absentee ballots are inadvertently not timely counted in an election,” Haas says. Madison “takes this effort to create new law seriously and opposes it because, in addition to affecting [Madison], it will also affect municipalities across the state which could be on the hook to pay damages whenever a human error is made by election staff or poll workers,” Haas adds. Millis objects to the primary argument made by the city’s lawyers in their response to the lawsuit that seeks damages for uncounted votes. In a court filing, the lawyers, representing former Madison Clerk Maribeth Witzel-Behl, who resigned in the wake of the uncounted ballots, and city officials, say that voters lost their constitutional right to vote when they cast absentee ballots. Voters who sued “describe the right to vote as ‘fundamental’ and ‘sacred,’ and cite a century-old precedent that the right to vote ‘may not under our Constitution be destroyed or even unreasonably restricted,’” the filing reads. “These points are undoubtedly true. However, the manner in which [voters] exercised their right to vote — by absentee ballot — took the process out of its core constitutional protection. When the absentee process unfortunately results in a vote not being counted, it is not a violation of a constitutional right.” Madison has a long history of supporting absentee voting, says city attorney Haas. Wrong, Millis says in a statement. A Republican appointee to the Elections Commission, he has been a member of boards and commissions overseeing elections for years. “While the option to cast an absentee ballot is not guaranteed by the Constitution, as soon as Wisconsin permitted absentee voting, voters casting absentee ballots in accordance with law have the absolute constitutional right to have their votes counted,” Millis says. Millis says the city’s argument is basically what the Trump campaign argued after Trump failed to secure a second term in November 2000: that voters who follow the rules to cast their ballots have no constitutional right to have their vote counted, as hewrotein an opinion column for theMilwaukee Journal Sentinel. Wisconsin judges ultimately rejected the argument from Trump campaign lawyers that more than 200,000 “absentee ballots cast in Dane and Milwaukee counties should not be counted.” In a Jan. 23statement, Madison officials said “all forms of voting — including absentee voting — should be encouraged, promoted and protected.” “A mistake was made,” city officials added. But, “Our laws do not provide voters with monetary compensation for mishandling an absentee ballot…[A]ttaching a dollar value to a vote, when human mistakes occur in elections, would end up regularly costing cities, towns and municipalities hundreds, thousands — or in this case millions — of dollars.” In a legalbrieffiled in the case, Gov. Tony Evers also said there is a constitutional right to cast an absentee ballot. Madison officials didn’t report the 193 uncounted absentee ballots for weeks, which prompted an Elections Commission investigation thatfoundthat laws were broken and recommended changes in city procedures. Haas says Madison officials have made changes to make sure the November error is not repeated. Steven Walters started covering the Capitol in 1988. Contact him stevenscotwalters@gmail.com. bySteven Walters February 5, 2026 9:00 AM", "date": "2026-02-05", "author": "bySteven Walters", "section": "news", "location": "state street", "source": "isthmus"}
